Repository: botswana-combination-prevention-project/bcpp-v1
Catalog: bhp066/locale/tn/LC_MESSAGES/django.po
Languages: tn

source: Work at Tavern/Bar/Entertainment Venue
tn: Ke bereka mo bareng kgotsa lefelo la itoso bodutu

source: Mining
tn: Moepo

source: Tourism/game parks
tn: Ditirelo tsa bojanala jaaka mo phakeng

source: Informal vendors
tn: Mogwebi yo o mmotlana/ semausu

source: Commercial sex work
tn: Mogwebi ka mmele

source: Transport (e.g., trucker)
tn: Tsa dipalamo (jaaka go kgweetsa megobagoba)

source: Factory worker
tn: Ke bereka mo madirelong

source: Clerical and office work
tn: Mokwaledi wa ofisi

source: Small business/shop work
tn: Kgwebo e potlana/ go bereka mo lebentleleng

source: Fishing
tn: Go tshwara ditlhapi

source: Uniformed services
tn: Modiri wa tsa sepodisi, sesole, dikgolegelo

source: 1-200 pula
tn: 1-99 pula

source: More than 10,000 pula
tn: Go feta 10,000 pula

source: Fixed salary
tn: Kamogelo e e diretsweng ruri(Fixed salary)

source: Paid daily
tn: Ke duelwa ka letsatsi

source: Paid hourly
tn: Ke duelwa ka oura

source: More than 20,000 pula
tn: Go feta 20, 000 pula

source: Studying
tn: Ke tsena sekolo

source: Doing housework
tn: Ke bereka mo lwapeng

source: Looking for work
tn: Ke senka/ batla tiro

source: Doing nothing (not looking for paid work)
tn: Ga ke dire sepe (ga ke senke/ batle tiro)

source: Retired/old age
tn: Ke godile kgotsa ke tlogetse tiro ka bogodi

source: Pregnant or recently pregnant
tn: Ke moimana/ ke imile

source: Sick or injured
tn: Ke a lwala kgotsa ke golafetse

source: I don't have time
tn: Ga ke na nako

source: I don't want to answer the questions
tn: Ga ke eletse go araba dipotso tse

source: I don't want to have the blood drawn
tn: Ga ke eletse go tsewa madi a mmele

source: I am afraid my information will not be private
tn: Ke na le letshogo la go gore e tla seke e nne sephiri

source: Fear of needles
tn: go tshaba lomao

source: Illiterate does not want a witness
tn: Ga a itse go bala le go kwala. Ga a batle mosupi

source: I haven't had a chance to think about it
tn: Ga ke ise ke nne le nako ya go ikakanya

source: Have a newly born baby, not permitted
tn: ke na le ngwana yo o sa tswang go belegwa, ga ke letlelelwe

source: Already on HAART
tn: Ke setse ke tsaya diritibatsi

source: I want to test where i always test
tn: Ke batla go itlhatlhoba kwa ke itlhatlhobang teng gale

source: I already know my partner's status, no need to test
tn: Ke setse ke itse seemo sa mokapelo wame, ga ke tlhoke go tlhatlhoba

source: The appointment was not honoured
tn: Ga a tla loetong

source: Patient called to come for visit
tn: Molwetsi o leditse a kopa go tla

source: Date of birth
tn: Letsatsi la matsalo

source: Please tell me your current HIV status?
tn: Ke kopa go itse seemo sa gago sa HIV mo bogompienong?

source: Are you currently taking antiretroviral therapy (ARVs)?
tn: A mo bo gompienong o tsaya melemo ya diritibatsi?

source: Please indicate the reason the household cannot be enumerated
tn: Tswee tswee tlhalosa lebaka la gore ke eng lolwapa le sa balwa

source: Reasons could be absentees, refusals, e.t.c
tn: Mabaka e kanna go sa nne teng, go gana, jalo jalo

source: Absent
tn: Ga a yo (absent)

source: No longer absent
tn: O teng (no longer absent)

source: Gone visiting
tn: O etile

source: Stays at Lands/Cattlepost
tn: O nna ko masimo/ moraka

source: Stepped out (shops, errands, )
tn: O santse a dule (mabenkeleng)

source: Works in the village, home daily
tn: O berekela mono gae, o tla lwapeng malatsi otlhe

source: Schools in this village, home daily
tn: O tsena sekolo mono gae, o tla lwapeng malatsi otlhe

source: Works outside the village, home daily
tn: O berekela kwa ntle ga motse o, o mo lwapeng malatsi otlhe

source: Schools outside village, home daily
tn: O tsena sekolo kwa ntle ga motse o, o mo lwapeng malatsi otlhe

source: Works outside the village, home irregularly
tn: O berekela kwa ntle ga motse o, o mo lwapeng fa gongwe

source: Schools outside village, home irregularly
tn: O tsena sekolo kwa ntle ga motse o, o mo lwapeng fa gongwe

source: Works outside the village, home monthly
tn: O berekela kwa ntle ga motse o, o mo lwapeng ka kgwedi

source: Schools outside village, home monthly
tn: O tsena sekolo kwa ntle ga motse o, o mo lwapeng ka kgwedi

source: Works outside the village, home on weekends
tn: O berekela kwa ntle ga motse o, o mo lwapeng ka mafelo a beke

source: Schools outside village, home on weekends
tn: O tsena sekolo kwa ntle ga motse o, o mo lwapeng ka mafelo a beke

source: Other...
tn: Tse dingwe

source: Participant
tn: Motsayakarolo

source: household member
tn: Monni wa mo lwapeng

source: Job Transfer
tn: Go fudusiwa ka tiro

source: Marriage
tn: Lenyalo

source: Independence
tn: Go ikemela ka nosi

source: Within Village
tn: Mo gae

source: Outside Village
tn: E seng mo gae

source: afraid_to_test
tn: go tshaba go itlhatlhoba

source: not ready to test
tn: Ga ise ke nne mo seemong sa go tlhatlhoba

source: wishes to test with partner
tn: O eletsa go itlhatlhoba le mokapelo

source: What is the main type of flooring for this household?
tn: Go dirisitswe bodilo jwa mofuta o fe mo lwapeng?

source: How many living rooms are there in this household unit (exclude garage, bathroom, kitchen, store-room, etc if not used as living room )?
tn: Matlo a borabola a ka fe mo lwapeng (go sa akaretse garage, ntlo ya bothapelo, ntlo ya boapeelo, ntlo ya mabeelo, fa di sa dirisiwe jaaka ntlo ya boitapoloso )?

source: What is the main source of drinking water for this household?
tn: Mo lwapeng metsi a gonwa le a tsaya kae?

source: What is the main source of energy used for cooking?
tn: Le dirisa eng thata go apaya?

source: What is the main toilet facility used in this household?
tn: Go dirisiwa ntlwana ya boithomelo ya mofuta mang mo lwapeng?

source: Does any member of this household have any of the following that are currently working? (check all that apply).
tn: A mongwe wa lelwapa le o na le nngwe ya tse di latelang ebile e bereka mo bo gompienong (check all that apply)?

source: Does any member of this household (excluding visitors) own any of the following forms of transport in working condition? (check all that apply).
tn: A mongwe mo lwapeng ( kwa ntle ga baeng) o na le sepalamo sa tse di latelang ebile di bereka mo bo gompienong (check all that apply)?

source: How many goats are owned by the members of this household? [If unsure of exact number, give your best guess]
tn: Le na le dipodi di le kae mo lwapeng? [O ka akanyetsa fa o sa tlhomamise palo ya tsone]

source: How many sheep are owned by the members of this household? [If unsure of exact number, give your best guess]
tn: Le na le dinku di le kae mo lwapeng? [O ka akanyetsa fa o sa tlhomamise palo ya tsone]]

source: How many head of cattle (cows and bulls) are owned by the members of this household? [If unsure of exact number, give your best guess]
tn: Le na le dikgomo(dikgomo le dipoo)di le kae mo lwapeng? [O ka akanyetsa fa o sa tlhomamise palo ya tsone]

source: In the past 4 weeks, did you or any household member have to eat a smaller meal than you felt you needed because there was not enough food?
tn: Mo bekeng tse nne tse di fetileng, a wena kgotsa mongwe mo lwapeng o ne a tlhoka go ja dijo tse di nnye go na le tse o di tlhokang ka gore dijo di ne di sa lekane?

source: None
tn: Ga gona

source: Non Formal
tn: Thuto ga e golelwe

source: Tertiary (Higher than secondary, such as vocational college or university)
tn: Sekolo sa ithutelo tiro (kwa godimo ga sekolo se segolwane jaaka vocational college kgotsa university)

source: Full-time employed
tn: O bereka tiro ya sennela ruri

source: Part-time employed
tn: O bereka tiro ya nakwana

source: Seasonal or intermittent employment
tn: Go bereka ga nakwana

source: Retired
tn: Ke godile kgotsa ke tlogetse tiro ka bogodi

source: Not working (non-student, not retired)
tn: ga a bereke (ga se moithuti, ga a tlogela tiro ka bogodi)

source: Single/Never married
tn: Ga ke a nyalwa/nyala/ ga keise ke ko ke nyalwe/nyale

source: Cohabitating
tn: bakapelo ba ba nnang mmogo ba sa nyalana

source: Married
tn: Lenyalo

source: Monthly or less
tn: kgwedi go ya ko tlase

source: 2-4 times per month
tn: Gabedi go ya ko go gane mo kgweding

source: 2-3 times per week
tn: Gabedi go ya gararo mo bekeng

source: 4 or more times per week
tn: Gane le go feta mo bekeng

source: TVCT in this community
tn: TVCT Mo motseng o

source: TVCT outside of this community
tn: TVCT e seng mo motseng o

source: Public Health Facility
tn: Lefelo la puso la ditirelo tsa botsogo

source: Private Health Facility
tn: Kokelo kgotsa sepatela se eseng sa puso

source: Door to door projects
tn: mananeo a go tsena ka ntlo le ntlwana

source: Other VCT site
tn: mafelo a mangwe a tlhatlhobo

source: Don't remember
tn: ga a gakologelwe

source: Declined to answer
tn: Ga a eletse go araba

source: I already know I am HIV positive.
tn: Ke setse ke itse gore ke na le mogare wa HIV positive

source: I don't believe I am at risk of getting HIV.
tn: Ke ne ke sa dumele gore ke mo diphatseng tsa go tsenwa ke HIV

source: I am afraid to find out the result.
tn: Ke na le letshogo la go itse maduo

source: I am afraid of what others would think of me.
tn: Ke na le letshogo la gore batho ba tla reng ka nna

source: Friends/Family did not want me to get an HIV test.
tn: Ba lelwapa/masika ba ne ba sa batle ke itlhatlhobela HIV

source: I did not have time due to work.
tn: Ke ne ke sena nako ka lebaka la tiro

source: My sexual partner didn't want me to get an HIV test
tn: Mokapelo wa me wa tlhakanelo dikobo o ne a sa batle ke itlhatlhobela HIV

source: Decline to answer
tn: Ga a eletse go araba

source: Cough > 2 weeks
tn: sehuba > beke tse pedi

source: Fever > 2 weeks
tn: Mogote > beke tse pedi

source: Enlarged lymph nodes
tn: Go ruruga dikgeleswa

source: Coughing up blood
tn: sehuba se se madi

source: Night Sweats
tn: go fufula bosigo

source: Unexplained weight loss
tn: go latlhegelwa ke mmele mo go senang tlhaloso

source: None of the above symptoms reported
tn: ga go a bolelwa sepe sa dikai tse di fa godimo

source: Circumcision
tn: go kgaola letlalo la bonna

source: STI screening
tn: tlhatlhobo ya malwetse a tlhakanelo dikobo

source: Family Planning
tn: katoloso ya tsholo

source: TB screening
tn: tlhatlhobo ya bolwetsi jwa kgotlholo e tona

source: Couple Testing
tn: Go itlhatlhoba ga bakapelo

source: PMTCT
tn: Thibelo ya mogare go tswa mo go mmangwana go ya kwa loseeng

source: HIV Care and Treatment
tn: Tlhokomelo le kalafi ya mogare wa HIV

source: Supportive Counseling
tn: Bogakolodi

source: Psycho social support/Social Welfare
tn: Ditlamelo tsa bogakolodi

source: Public/Private Health Facility
tn: Kokelo kgotsa sepatela se eseng sa puso

source: Religious Institution
tn: Lefelo la kobamelo

source: PLWH/A Association
tn: Mokgato wa batho ba ba tshelang ka mogare wa HIV

source: Social Welfare facilities
tn: Ditlamelo tsa boipelego

source: Youth Friendly Services
tn: ditlamelo tse di tshwanetseng banana

source: What is this partner's HIV status?
tn: Seemo sa mogare wa HIV sa mokapelo ke sefe?

source: Date CD4 test performed
tn: Letsatsi le tlhatlhobo ya masole a mmele e dirilweng

source: Name of clinic referred to
tn: leina la kokelo e motsayakarolo a rometsweng ko go yone

source: Appointment date
tn: Thulaganyo ya letsatsi le nako

source: Was a male circumcision appointment made?
tn: A go dumalanwe letsatsi la go ya go kgaola letlalo la bonna

source: Male circumcision appointment date
tn: Letsatsi le le dumalanweng go ya go kgaola letlalo la bonna

source: Format is YYYY-MM-DD (If male, negative and uncircumcised)
tn: dirisa thulaganyo ya YYYY-MM-DD

source: What is your highest level of education have you completed?
tn: O tsene sekolo go fitlha fa kae?

source: What is your current employment status?
tn: Seemo sa gago sa go bereka mo bogompienong ke eng?

source: What is your current marital status?
tn: Seemo sa gago sa nyalo ke eng mo bogompienong?

source: Now I would like to ask you about how frequently you drink alcohol. In the past THREE months, how often have you had a drink containing alcohol?
tn: Jaanong ke eletsa go go botsa ka gore o nwa bojalwa ga kae. Mo dikgweding tse tharo tse di fetileng, o nole bojalwa ga kae?

source: Do you consent to HIV testing and counseling today?
tn: A o dumela go tlhatlhobela mogare wa HIV tsatsi jeno?

source: What is the main reason you did not want HIV testing as part of today's visit?
tn: Lebaka legolo la go bo o sa eletse go tlhatlhobela HIV gompieno ke lefe?

source: Male circumcision is the removal of the foreskin of the penis. Here is a diagram to clarify what a circumcised and uncircumcised man looks like. Are you circumcised?
tn: go rupa ga borre go raya go kgaola letlalo la bonna. Se ke setshwantsho se se supang gore bonna jo bo kgaotsweng letalo le jo bo sa kgaolwang bo lebega jang. A wena o kgaotse?

source: What year were you circumcised?
tn: O dirile loara la borre ka ngwaga e fe?

source: Today's results:
tn: Madua a tsatsi jeno

source: Did testing and counseling occur through couples testing today?
tn: A tlhatlhobo e dirilwe e le ya bakapelo ba le mmogo

source: What is the unique identification number for the other member of the couple?
tn: Nomore e e faphegileng e e kayang mokapelo o mongwe ke efe?

source: Does the client currently have any of the following symptoms?
tn: A motsayakarolo o na le dikai tse di latelang?

source: Have any of the client's family members been diagnosed with tuberculosis?
tn: A go na le mongwe wa masika a motsayakarolo yo o fitlhestweng a na le kgotlholo e tona

source: Have you ever previously been tested for HIV?
tn: A o kile wa itlhatlhobela HIV mo nakong e e fetileng?

source: Where did you last undergo HIV testing?
tn: O dirile kae labofelo tlhatlhobelo ya mogare wa HIV?

source: Is a record of your last HIV test available to review today?
tn: A mokwalo wa tlhatlhobo ya HIV oteng [karata ya sepatela/clinic, karata ya , Tebelopele,kgotsa sengwe fela] go ka sekwa sekwa?

source: Was HIV- test result obtained in the past 3 months?
tn: A maduo a tlhatlhobelo ya HIV a amogetswe mo kgweding tse tharo tse di fetileng ?

source: I would like to start by asking some questions about your most First sexual partner. What is yourrelationship with this partner?
tn: Ke tlaa simolola ka go botsa dipotso ka mokapelo wa gago wa tlhakanelo dikobo. Botsalano jwa gago le ene ke eng?

source: Now I am going to ask you about your second most recent sexual partner. What is your relationship with this partner?
tn: Jaanong ke tlaa botsa ka mokapelo wa gago wa bobedi wa tlhakanelo dikobo. Botsalano jwa gago le ene ke eng?

source: Cell number (alternate)
tn: Mogala wa letheka (o mongwe)

source: If we are unable to contact the person indicated above, is there another individual (including next of kin) with whom the study team can get in contact with?
tn: Fa re sa kgone go ikgolaganya le motho yo o boletsweng fa godimo, a go na le mongwe (go akaretsa masika) o re ka ikgolaganyang le ene?

source: Full Name of the responsible person
tn: Maina ka botlalo a motho yo o tsayang maikarabelo

source: Relationship to participant
tn: Botsalano le motsaya karolo

source: Cell number
tn: Mogala wa letheka (cell phone)

source: Telephone number
tn: Mogala

source: Now I am going to ask you about your third most recent sexual partner. What is your relationship with this partner?
tn: Jaanong ke tlaa botsa ka mokapelo wa gago wa boraro wa tlhakanelo dikobo. Botsalano jwa gago le ene ke eng?

source: Recorded date of previous test:
tn: Go kwadilwe letsatsi le fe la tlhatlhobo ya HIV?

source: Recorded result of previous test:
tn: Maduo a tlhatlhobo ya bofelo a a mo mokwalong

source: What is the name of the clinic most recently visited for HIV care?
tn: Leina la kokelo e o e dirisitseng la bofelo mabapi le tlhokomelo ya mogare wa HIV ke lefe?

source: Do you have an ART card or HIV care enrollment card available to review today?
tn: A o tshotse karata ya diritibatsi kgotsa ya tlhokomelo ya mogare wa HIV e re ka e lebelelang tsatsi jeno?

source: My fellow counselors and I are available to help you decide if circumcision is right for you and to access male circumcision services. If we try to call you and miss you, the caller will not leave any detailed message but only his name and number. If someone asks, we will just say we are doing mobilization for men's health. Do you give permission for counselors to contact you by telephone and home visits?
tn: Nna le bagakolodi ka nna re teng go go thusa go tsaya tshwetso ya gore a go kgaola letlalo la bonna go go siametse le go bona dithuso tsa go kgaola letlalo la bonna. Fa re go leletsa re sa go tshware, moletsi ga a kake a tlogela molaetsa o o tletseng, o tla tlogela leina le nomore ya mogala wa gagwe fela. Fa mongwe a botsa re tla re re dira ka botsogo jwa borre. A o fa bagakolodi tetla ya go ikgolaganya le wena ka go go leletsa?

source: If we are unable to reach you, would you be willing to have me or one of my fellow counselors contact a family member or friend who would be able to reach you? The caller will not leave any detailed message but only his name and number.
tn: Fa re sa kgone go ikgolaganya le wena, a o ka eletsa gore nna kgotsa mogakolodi ka nna o ka ikgolaganya le mongwe wa losika kgotsa tsala yo o ka ikgolaganyang le wena. Moletsi ga a na go tlogela molaetsa o o tletseng, o tla tlogela leina le nomore ya mogala wa gagwe fela

source: My fellow counselors and I are available to help you begin HIV care at the local health clinic. Do you give permission for counselors to contact you by telephone and make home visits to make sure you get the care you need
tn: Nna le bagakolodi ka nna re teng go go thusa go simolola tlhokomelo ya mogare wa HIV ko kokelong e e gaufi. A o fa bagakolodi tetla ya go ikgolaganya le wena ka go go leletsa le go go etela ko lwapeng go tlhomamisa gore o bona tlhokomelo e o e tlhokang?

source: If we are unable to reach you, would you be willing to have me or one of my fellow counselors contact a family member or friend who would be able to reach you
tn: Fa re sa kgone go ikgolaganya le wena, a o ka eletsa gore nna kgotsa mogakolodi ka nna o ka ikgolaganya le mongwe wa losika kgotsa tsala yo o ka ikgolaganyang le wena

source: It is recommended that pregnant women receive antenatal care for their health and their baby's health. This care includes an HIV test during the third trimester of pregnancy. Counselors are available to help you receive HIV testing during pregnancy. Do you give permission for counselors to contact you by telephone and home visits?
tn: Go rotloediwa gore bomme ba ba itsholofetseng ba amogele tlhokomelo ya boimana go sireletsa botsogo jwa bone le jwa bana ba bone. Tlhokomelo e e akaretsa go itlhatlhobela mogare wa HIV mo kgweding tse tharo tsa bofelo tsa boimana. Bagakolodi ba teng go go thusa go amogela tlhatlhobo fa o itsholofetse. A o fa bagakolodi tetla ya go ikgolaganya le wena ka go go leletsa le go go etela ko lwapeng?

source: If we are unable to reach you, would you be willing to have me or one of my fellow counselors contact a family member or friend who would be able to reach you?
tn: Fa re sa kgone go ikgolaganya le wena, a o ka eletsa gore nna kgotsa mogakolodi ka nna o ka ikgolaganya le mongwe wa losika kgotsa tsala yo o ka ikgolaganyang le wena?

source: Client referred FOR:
tn: motsayakarolo o romeletswe:

source: Client referred TO:
tn: motsayakarolo o rometswe ko:

source: Routine oncology clinic visit (i.e. planned chemo, follow-up)
tn: Maeto a tlwaelo ko kokelong (jaaka, go tla go tsaya melemo ya bolwetsi jwa kankere)

source: Ill oncology clinic visit
tn: O tla kokelong ka gore o a lwala (ill oncology clinic visit)

source: Longterm partner (>2 years) or spouse
tn: Mokapelo wa lebaka le le leele(go feta ngwaga tse pedi) kgotsa monna/mosadi wame

source: Other, specify
tn: Tse dingwe, tlhalosa

source: On farm/cattle post
tn: Mo masimo/ morakeng

source: Vaginal sex
tn: Tlhakanelo dikobo ya ka fa bosading

source: Anal sex
tn: Tlhakanelo dikobo ya ka fa maragong

source: Both vaginal and anal sex
tn: Mefuta yotlhe, ka fa bosading le ka fa maragong

source: Occassional or Casual employment (piece job)
tn: Tiro ya nakwana (piece job)

source: Seasonal employment
tn: Go bereka ga nakwana

source: Formal wage employment (full-time)
tn: Tiro ya nako tsotlhe o duelwa (full time)

source: Formal wage employment (part-time)
tn: Tiro ya nako nngwe o duelwa (part-time)

source: Self-employed in agriculture
tn: Ke ipereka mo go tsa temo

source: Self-employed making money, full time
tn: Ke a ipereka ke dira madi, nako yotlhe

source: Self-employed making money, part time
tn: Ke a ipereka ke dira madi, nako tse dingwe

source: Waiting to continue agricultural work
tn: Ke emetse go tsweledisa tsa temo

source: Unemployed (looking for work)
tn: Ga ke bereke (Ke batla tiro)

source: Unemployed (waiting to start new work)
tn: Ga ke bereke (Ke letile go simolola tiro a nngwe)

source: Unable to work (permanently sick or injured)
tn: Ga ke kgone go bereka (Ke a lwala kgotsa ke golafetse)

source: Student/ Apprentice/ Volunteer
tn: Moithuti/ Moithaopi

source: Housewife/ Homemaker (not looking for work)
tn: Housewife (Ga ke batle tiro)

source: Not looking for work
tn: Ga ke senke/ batle tiro

source: Farm work on employers land
tn: O bereka mo polasing ya mong

source: Domestic worker
tn: Ke bereka mo lwapeng

source: Work in bar/ hotel/ guest house
tn: Ke bereka mo bareng kgotsa lefelo la itoso bodutu

source: Working in shop
tn: Ke bereka mo lebenkeleng

source: Informal selling
tn: Mogwebi yo o mmotlana/ semausu

source: Transport (trucker/ taxi driver)
tn: Tsa dipalamo (jaaka go kgweetsa megobagoba)

source: Guard (security company)
tn: Ba tsa tlhokomelo ya dikago (security guard)

source: Police/ Soldier
tn: Lepodise/ Lesole

source: Government worker
tn: Mmereki wa Goromente/Puso

source: Teacher
tn: Morutabana

source: Health care worker
tn: Modiri wa botsogo

source: Other professional
tn: Professional

source: No income
tn: Ga ke a amogela sepe

source: 1-199 pula
tn: 1-99 pula

source: Child support
tn: Tlhokomelo ya ngwana

source: Old age pension
tn: Madi a bagodi

source: Foster care
tn: Tlhokomelo ya bana mo lefelong le le faphegileng (foster care)

source: Disability (disability dependency)
tn: Go tshela le bogole

source: Dirt/earth
tn: mmu/lefatshe

source: Wood, plank
tn: legong, polanka

source: Parquet/lino
tn: moalo wa dikgong

source: Cement
tn: Samente

source: Tile flooring
tn: Dithaele/Tile

source: Communal tap
tn: Pompo ya morafe

source: Standpipe/tap within plot
tn: Pompo ya mo jarateng

source: Piped indoors
tn: Metsi a a mo ntlong

source: Borehole
tn: Sediba

source: Protected well
tn: Sediba se se ageletsweng

source: Unprotected/shallow well
tn: Sediba se se sa agelelwang se se boteng

source: River /dam/lake/pan
tn: Noka /letamo/letsha

source: Bowser/tanker
tn: Metsi a le nosiwang ka koloi kgotsa tanka

source: Other, specify (including unknown):
tn: Tse dingwe, tlhalosa (le tse di sa itseweng):

source: Charcoal/wood
tn: Magala/dikgong

source: Paraffin
tn: Parafine

source: Gas
tn: Gase

source: Electricity (mains)
tn: Motlakase

source: Electricity (solar)
tn: Motlakase was letsatsi la marang

source: No cooking done
tn: Ga go apewe

source: Pit latrine within plot
tn: Ntlwana ya boithomelo ya lefuti mo lwapeng

source: Flush toilet within plot
tn: Ntlwana e e dirisang metsi mo lwapeng

source: Neighbour's flush toilet
tn: Ntlwana e e dirisang metsi ya moagisanyi

source: Neighbours pit latrine
tn: Ntlwana ya lefuti ya moagisanyi

source: Communal flush toilet
tn: Ntlwana e e dirisang metsi ya morafe

source: Communal pit latrine
tn: Ntlwana ya lefuti ya morafe

source: Pail bucket latrine
tn: Ntlwana ya emere

source: Bush
tn: Sekgwa
