Repository: botswana-combination-prevention-project/bcpp-v1
Catalog: bhp066/locale/tn/LC_MESSAGES/django.po
Languages: tn

source: River or other body of water
tn: Noka

source: Rarely
tn: Ka sewelo

source: Often
tn: Gantsi/ kgapetsakgapetsa

source: Most recent (within past 3 months) CD4 < 50
tn: Mo bo gaufing (mo kgweding tse tharo tse di fetileng) masole a mmele a le ko tlase ga 50 (CD4 < 50)

source: Most recent (within past 3 months) CD4 50-100
tn: Mo bo gaufing (mo kgweding tse tharo tse di fetileng) masole a mmele a le 50 go ya go 100 (CD4 50-100)

source: Tuberculosis
tn: kgotlholo e tona

source: Wasting
tn: Go latlhegelwa ke mmele

source: Pneumocystis pneumonia
tn: PCP (Pneumocystis pneumonia)

source: Cervical cancer
tn: Kankere ya molomo wa popelo

source: Other, record
tn: Tse dingwe, record

source: Referred to receive HIV result in clinic
tn: O rometswe go tsaya maduo a HIV ko kokelong

source: Referred to test in clinic
tn: O rometswe go ya go tlhatlhoba ko kokelong

source: spouse
tn: Mokapelo kgotsa monna/mosadi wame

source: parent
tn: Batsadi

source: sibling
tn: Bomorwarre(bonnake/bonkgonne)

source: child
tn: ngwanake

source: aunt/uncle
tn: mmangwane/ malome

source: cousin
tn: ntsalake

source: partner/boyfriend/girlfriend
tn: mokapelo (partner/boyfriend/girlfriend)

source: Participant does not want to provide record
tn: Motsayakarolo ga a batle go ntsha sesupo (record)

source: Reduced risk of HIV
tn: Phokotsego ya bodiphatsa tsa go tsenwa ke HIV

source: Reduced risk of other sexually transmitted diseases
tn: Phokotsego ya bodiphatsa tsa go tsenwa ke malwetse a mangwe a tlhakanelo dikobo

source: Reduced risk of cancer
tn: Phokotsego ya bodiphatsa tsa bolwetse ja kankere

source: Heart Disease or Stroke
tn: Bolwetsi jwa pelo kgotsa go swa mhama

source: Cancer
tn: Kankere

source: Tubercolosis
tn: Kgotlholo e tona

source: Other serious infection
tn: Malwetsi a mangwe a a tlhwaafetseng

source: TV
tn: Television

source: Landline telephone
tn: Mogala wa mo lwapeng

source: Cell phone
tn: Mogala wa letheka (cell phone)

source: Computer
tn: Computara

source: Access to internet
tn: Internet

source: Refrigerator
tn: Setsidifatsi

source: Condoms, consistent use (male or female)
tn: Tiriso ya sekausu nako tsotlhe

source: Injectable contraceptive
tn: Thibelo /iphemelo pelegi ya mokento

source: Oral contraceptive
tn: Dipilisi

source: Diaphragm or cervical cap
tn: Loselo/ Leselo

source: Rhythm or menstrual cycle timing
tn: Boiphemelo jwa go ela tlhoko malatsi a setswalo

source: Withdrawal
tn: Go somola bonna mo bosading pele ga o tsholola metsi a senna

source: Partner or spouse
tn: Monna/ Mosadi wa gago

source: Siblings
tn: Bomorwarre(bonnake/bonkgonne)

source: Alone
tn: Ke le nosi

source: Extended family
tn: Masika

source: Water
tn: Metsi

source: Sewer (sanitation)
tn: Kgopho ya metsi a a leswe

source: Housing
tn: Boroko

source: Roads
tn: Ditsela

source: Schools
tn: Dikolo

source: Unemployment
tn: Letlhoko la ditiro

source: Outside community
tn: Kwa ntle ga motse o

source: Farm within this community
tn: Kwa masimo mo motseng o

source: Farm outside this community
tn: Kwa masimo e seng mo motseng o

source: Cattle post within this community
tn: Ko morakeng mo motseng o

source: Cattle post outside this community
tn: Kwa morakeng e seng mo motseng o

source: Motor vehicle (car,truck,taxi, etc)
tn: Koloi (car, truck, taxi)

source: Tractor
tn: Terekere

source: Bicycle
tn: Baesekele

source: Motorcycle/scooter
tn: Sekuta

source: Donkey or cow cart
tn: Kara ya ditonki kgotsa ya dikgomo

source: Donkey/horses
tn: Ditonki/ dipitse

source: Read to Participant: Now, I will be asking you about your preferences and options for accessing health care when you need it.
tn: Read to Participant: Ke tlaa botsa ka dikeletso tsa gago le thato ya gago ya go amogela di tsa botsogo fa o di tlhoka

source: Read to Participant: Some men are circumcised. Male circumcision is [enter site specific word] when the foreskin of the man's penis has been cut off. I would like to ask you a few questions regarding male circumcision.
tn: Read to Participant: Banna ba bangwe ba dirile loaro la borre. Ke tlaa kopa go botsa dipotso di le sekae tse di amanang le loaro la borre.

source: Read to Participant: Next, I will ask you some questions about what education and work you may have done or are currently doing.
tn: Read to Participant: Mo go tse di latelang, ke tlaa botsa dipotso tse di amanang le thuto le go bereka mo o ka tswang o go dirile kgotsa e le mo o go dirang gompieno.

source: Read to Participant: Many people have had a test to see if they have HIV. I am going to ask you about whether you have been tested for HIV and whether you received the results. Please remember that all of your answers are confidential.
tn: Read to Participant: Batho ba le bantsi ba ne ba itlhatlhoba go bona gore a ba ka tswa ba na le mogare wa HIV. Dipotso tse di latelang ke ka gore a o itlhatlhobetse mogare wa HIV le gore a o bone maduo. Gakologelwa gore dikarabo tsotlhe tsa gago di bewa e le sephiri.

source: Read to Participant: I am now going to ask you some questions about major illnesses that you may have had in the past 12 months. Sometimes people call different sicknesses by different names. If you do not understand what I mean, please ask. Also, please remember that your answers will be kept confidential.
tn: Read to Participant: Ke tsile go go botsa dipotso ka mangwe makoa kgotsa malwetse a o ka tswang o kile wa nna nao mo lebakeng la dikgwedi di le lesome le bobedi tse di fetileng. Fa gongwe batho ba bitsa malwetsi ka maina a farologanyeng, fa o sa tlhaloganye se ke se buang, tswee tswee, o ka botsa. O gakologelwe gore dikarabo tsotlhe di tlaa bewa e le sephiri.

source: Read to Participant: I am now going to ask you about your most recent sexual partners. I will start with your last or most recent sexual partner.
tn: Read to Participant: Jaanong ke tsile go go botsa ka mokapelo kgotsa bakapelo ba gago ba gompieno. Ke tlaa simolola ka wa bohelo.

source: Read to Participant: I am now going to ask you about your second most recent sexual partner in the past 12 months, the one before the person we were just talking about.
tn: Read to Participant: Jaanong ke tsile go go botsa ka mokapelo wa gago wa bobedi mo kgweding tse di lesome le bobedi tse di fetileng, ke raya wa pele ga o re ntseng re bua ka ene

source: Read to Participant: I am now going to ask you aboutyour second most recent sexual partner in the past 12 months, the one before the person we were justtalking about.
tn: Read to Participant: Jaanong ke tsile go go botsa ka mokapelo wa gago wa bobedi mo kgweding tse di lesome le bobedi tse di fetileng, ke raya wa pele ga o re ntseng re bua ka ene

source: Read to Participant: You let us know earlier that you are HIV positive. I would now like to ask you a few questions about your experiences living with HIV. Please remember this interview and your responses are private and confidential.In this section, I'm going to read you statements about how you may feel about yourself and your HIV/AIDS infection. I would like you to tell me if you strongly agree, agree, disagree or strongly disagree with each statement?
tn: Read to Participant: O setse o re itsisitse gore o na le mogare wa HIV. Jaanong ke eletsa go go botsa dipotso tse di amanang le go tshela ka bolwetsi jwa HIV. Tswee tswee, gakolgelwa gore potsolotso e, le dikarabo tsa gago di bewa e le sephiri. Mo karolong e, ke tlaa go balela ditsetlana ka fa o ka tswang o ikutlwa ka teng. Ke tlaa kopa gore o nkitsise gore a o a dumalana mo go tseneletseng, o a dumalana, ga o dumalane kgotsa ga o dumalane mo go tseneletseng mo tsetlaneng nngwe le nngwe.

source: Read to Participant: I am now going to ask you questions about reproductive health and pregnancy.
tn: Read to Participant: Dipotso tse di latelang ke tse di amanang le botsogo jwa tsholo le boimana

source: Read to Participant: To start, I will be asking you some questions about yourself, your living situation, and about the people that you live with. Your answers are very important to our research and will help us understand how to develop better health programs in your community. Some of these questions may be embarrassing and make you feel uncomfortable; however, it is really important that you give the most honest answer that you can. Please remember that all of your answers are confidential. If you do not wish to answer, you can skip any question.
tn: Read to Participant: Mo karolong e ya potsolotso, ke tlaabo ke go botsa dipotso ka wena, ka fa o tshelang ka teng le ka batho ba tshelang le bone. Dikarabo tsa gago di botlhokwa thata mo tlhatlhobong e, e bile e tlaa re thusa gore re kgone re dira mananeo a botsogo a botoka mo motseng o. Dingwe dipotso di ka tswa di sa go tsee sentle; mme tswee tswee re kopa gore o re fe dikarabo tse di boammaruri. Gakologelwa gore dikarabo tsa gago tsotlhe di sephiri.

source: Read to Participant: In this part of the interview, I will be asking you some questions about your sexual relationships that you might have had, and about sexual practices that you might have engaged in. Please let me know if you feel comfortable answering these questions now or if we should move to a different location. Some of these questions may make you feel uncomfortable; however, it is really important for us to get the most honest answer that you can give us. Please remember that all of your answers are confidential.
tn: Read to Participant: Mo karolong e ya potsolotso, ke tlaabo ke go botsa dipotso mabapi le maitsholo a gago a tlhakanelo dikobo. Tswee tswee ke kopa go itse gore a o gololesegile go ka araba dipotso tse gompieno kgotsa re ka batla lehelo le sele. Dipotso dingwe di ka nna tsa dira gore o seka wa tseega sentle, mme re kopa gore o arabe ka boammaruri le gore dikarabo tsotlhe e tlaabo e le sephiri.

source: Read to Participant: Different people feel differently about people living with HIV. I am going to ask you about issues relevant to HIV and AIDS and also people living with HIV. Some of the questions during the interview will ask for your opinion on how you think people living with HIV are treated. To start, when thinking about yourself, please tell me how strongly you agree or disagree with the following statements.
tn: Balela mo tsaya karolo: Batho ba bangwe ba

source: referred
tn: Yo o rometsweng

source: In the past year, where do you MOST OFTEN get medical care or treatment when you or someone in your family is sick or hurt?
tn: Mo lebakeng la ngwaga le le fetileng, gantsi o ne o bona tlhokomelo kgotsa kalafi ya bongaka kae fa wena kgotsa mongwe mo lwapeng a lwala kgotsa a sa tsoga sentle?

source: In the past year, where else have you obtained medical care or treatment when you or someone in your family is sick or hurt? (check all that apply)
tn: Mo lebakeng la ngwaga le le fetileng, ke ko kae gape ko o boneng/ o tsereng tlhokomelo kgotsa kalafi ya bongaka fa wena kgotsa mongwe mo lwapeng a lwala kgotsa a sa tsoga sentle (supa tsotlhe tse di lebaneng)?

source: If I need medical care, I can get seen by an appropriate health professional without any trouble.
tn: Fa ke tlhoka tlhokomelo ya bongaka, ke bonwa sentle ke modiri wa botsogo yo o lebaneng kwantle ga mathata ape.

source: It is hard for me to get medical care in an emergency
tn: Go thata gore ke bone tlhokomelo ya bongaka ka nako ya tshoganyetso

source: Sometimes I go without the medical care I need because it is too expensive.
tn: Fa gongwe ga ke kgone go bona tlhokomelo ya bongaka e ke e tlhokang ka gore go tura thata.

source: Places where I can get medical care are very conveniently located.
tn: Mafelo a ke ka bonang tlhokomelo ya bongaka teng a mo lefelong le le ntshiametseng/ le le gaufi lenna.

source: I am able to get medical care whenever I need it.
tn: Ke kgona go bona tlhokomelo ya bongaka nako nngwe le nngwe fa ke e tlhoka.

source: Would you be willing to come to the clinic within your community to receive HIV care and treatment, if available locally?
tn: A o ka eletsa go tla mo kokelong e e mo motseng wa lona go amogela tlhokomelo ya HIV, fa e le teng mo motseng wa lona?

source: Do you believe that male circumcision has any health benefits for you?
tn: A o dumela gore go rupisiwa ga borre go na le dipoelo tsa botsogo mo go wena?

source: What do you believe are the health benefits of male circumcision? (Indicate all that apply.)
tn: Ke di fe dipoelo tsa botsogo tse o dumelang gore diteng ka go rupa ga borre? Supa tsotlhe tse o akanyang gore ke tsone

source: When did you last (most recently) give birth?
tn: O belege leng la bofelo (mo bogaufing)?

source: During your last pregnancy (not current pregnancy) did you go for antenatal care?
tn: Ka boimana ja gago ja bofelo( eseng boimana ja gompieno) a o ne o tsamaya tshidilo ya baimana?

source: During your last pregnancy (not current pregnancy) were you tested for HIV?
tn: Ka boimana ja gago ja bofelo( eseng boimana ja gompieno) a o ne o tlhatlhobetswe HIV?

source: Were you given antiretroviral medications to protect the baby?
tn: A o ne o filwe melemo ya diritibatsi go sireletsa lesea/ngwana?

source: Over the past 12 months, where has this sexual partner lived to the best of your knowledge?
tn: Go ya ka kitso ya gago, mo kgweding tse di lesome le bobedi tse di fetileng mokapelo wa gago o ne a nna kae?

source: When was the last [most recent] time you had sex with this person (how long ago)?
tn: O tlhakanetse dikobo leng la bofelo le mokapelo yo wa gago( ke lebaka le le kae le le fetileng)?

source: Give the number of days/months since last had sex with this person.
tn: Fa, kgotsa bua sebaka sa malatsi/ dikgwedi fa e sale labofelo o tlhakanela dikobo le mokapelo o.

source: When was the first time you had sex with this person [how long ago]?
tn: O tlhakanetse dikobo leng lantlha le mokapelo yo wa gago( ke lebaka le le kae le le fetileng?

source: Give the number of days/months/years since first had sex with this person.
tn: Fa sebaka sa malatsi/ dikgwedi / dingwaga fa e sa le lantlha o tlhakanela dikobo le mokapelo o.

source: Do you expect to have sex with this person again?
tn: A o solofela go tlhakanela dikobo le motho yo gape?

source: What type of relationship do you have with this person?
tn: Botsalano jo o nang najo le motho yo ke jwa mofuta mang?

source: To the best of your knowledge, how old is this person?
tn: Go ya ka kitso ya gago, motho yo o dingwaga di kae?

source: Over the past 12 months, during the time you were having a sexual relationship with this person, did YOU have sex with other people (including husband/wife)?
tn: Mo lebakeng la kgwedi tse di lesome le bobedi tse di fetileng tse o neng o na le botsalano ja tlhakanelo dikobo le mokapelo yo, a O KILE wa tlhakanela dikobo le batho ba ba ngwe (go akaretsa monna kgotsa mosadi wa gago)?

source: Have you received money, transport, food/drink, or other goods in exchange for sex from this partner?
tn: A o kile wa amogela madi, sepalamo, dijo/dino, kgotsa dithoto dingwe go tswa mo mokapelong yo go tlhakanela dikobo?

source: During the last 3 months [of your relationship, if it has ended] how many times did you have sex with this partner?
tn: Mo kgweding tse tharo tse di fetileng(tsa botsalano jwa lona, fa e le gore bofedile) le tlhakanetse dikobo go ka nna kae?

source: Has your partner been tested for HIV in last 12 months
tn: A mokapelo wa gago o itlhatlhobetse mogare wa HIV mo dikgweding tse di lesome le bobedi tse di fitileng?

source: Is this partner taking antiretroviral treatment?
tn: A mokapelo yo o tsaya dipilisi tsa diritibatsi(di-ARV)?

source: Have you told this partner your HIV status?
tn: A o boleletse mokapelo yo seemo sa gago sa HIV?

source: When you have [had] sex with this partner, how often do you or your partner use a condom?
tn: Fa le/ fa le ne le tlhakanela dikobo le mokapelo yo, le dirisa sekausu ga kae?

source: To the best of your knowledge, did he/she ever have other sex partners while you two were having a sexual relationship?
tn: Go ya ka fa o itseng ka teng, a mokapelo wa gago o kile a nna le bakapelo ba bangwe ba tlhakanela dikobo fa wena le ene le santse le le mo botsalanong jwa tlhakanelo dikobo?

source: At what age were you circumcised?
tn: O dirile loaro la borre o le dingwaga di kae?

source: Where were you circumcised?
tn: O dirile loara la borre kae?

source: What was the main reason why you were circumcised?
tn: Lebaka legolo la gore o bo o dirile loara la borre ke lefe?

source: Are you circumcised?
tn: A o dirile loaro la borre?

source: Do you know your current HIV status?
tn: A o itse seemo sa gago sa HIV?

source: Is there evidence [OPD card, tablets, masa number] that the participant is on therapy?
tn: A go na le bosupi [OPD card, tablets, masa number] jwa gore mo tsayakarolo o nwa/tsaya diritibatsi?

source: How active are you in community activities such as burial society, Motshelo, Syndicate, PTA, VDC(Village Developement Committee), Mophato and development of the community that surrounds you??
tn: O tlhaga go le kae mo ditirong tsa se legae jaaka dintsho, metshelo, PTA, VDC, le ya botsogo le ya go tlhabolola motse o o nnang mo go one?

source: Did you vote in the last local government election?
tn: A one wa tlhopha mo ditlhophong tse di fetileng tsa selegae/khansele?

source: What are the major problems in this neighbourhood??
tn: Mathata a matona mo tikologong ya lona ke afe?

source: If there is a problem in this neighbourhood, do the adults work together in solving it?
tn: Fa go na le mathata mo tikologong e, a bagolo ba dira mmogo go rarabolola bothata jo?

source: What is your religion affiliation?
tn: O amana le tumelo efe?

source: What is your ethnic group?
tn: O wa morafe o fe?

source: WOMEN: How many wives does your husband have (including traditional marriage), including yourself?
tn: BOMME: Monna wa gago o na le basadi ba le kae (go akeradiwa le lenyalo la setswana), le wena mo palong?

source: MEN: How many wives do you have, including traditional marriage?
tn: BORRE: O na le basadi ba le kae go akarediwa le lenyalo la setswana

source: Who do you currently live with ?
tn: O nna le mang mo bo gompienong(kaya tsotlhe tse di lebaneng)?

source: To the best of your knowledge, where does you main sexual partner live?
tn: Go ya ka kitso ya gago e e tletseng, mokapelo wa gago wa konokono o nna kae?

source: How old is this sexual partner?
tn: Mokapelo yo, o na le dingwaga di le kae?

source: Is this partner male or female?
tn: A mokapelo yo ke rre kgotsa mme?

source: When was the last (most recent) time you had sex with this person (how long ago)?
tn: O tlhakanetse dikobo la bofelo leng(mo bo gaufing) le motho yo(lebaka le le kae le le fetileng)?

source: Record if number is in days/months/years
tn: Kwala sebaka sa malatsi/ dikgwedi/ dingwaga

source: When was the first time you had sex with this person (how long ago)?
tn: O tlhakanetse dikobo lantlha leng le motho yo?(ke lebaka le le kae le le fetileng)

source: During the last 3 months (of your relationship if it has ended) how many times a month (on average) did you have sex?
tn: Mo kgweding tse tharo tse di fetileng(tsa botsalano ja lona fa e le gore bo fedile),le tlhakanetse dikobo go ka nna ga kae mo kgweding?

source: Are you still having sex with this person?
tn: A o santse o tlhakanela dikobo le motho yo?

source: Last time you had sex with this partner, did you drink alcohol before sex?
tn: La bofelo o tlhakanela dikobo le mokapelo yo, a o ne o nole bojalwa pele ga tlhakanelo dikobo?

source: Have you learned this partner's HIV status?
tn: A o itse ka seemo sa mokapelo yo sa HIV?

source: Is this partner taking antiretroviral treatment?
tn: A mokapelo yo o tsaya kalafi ya diritibatsi?

source: Have you disclosed your HIV status to this partner?
tn: A o boleletse mokapelo yo seemo sa gago sa mogare wa HIV?

source: Can you tell me what type of sex you had with this sex partner?
tn: Ke kopa o mpolelele mofuta wa tlhakanelo dikobo ya gago le mokapelo wa gago?

source: What is your highest level of education attainment?
tn: O tsene sekolo go fitlha fa kae?

source: Are you currently working?
tn: A o a bereka?

source: In your main job what type of work do you do?
tn: Mo tirong ya gago, o bereka go dira eng?

source: What is the reason why you are not working?
tn: Lebaka la go bo o sa bereke ke le fe?

source: Describe the work that you do or did in your most recent job. If you have more than one profession, choose the one you spend the most time doing.
tn: Tlhalosa tiro e o e dirang kgotsa e o e dirileng kwa tirong ya gago ya bofelo. Fa o na le boitsaanape jo bo fetang bongwe, tlhopha bo le bongwe kwa o tsayang nako e ntsi teng.

source: In the past month, how much money did you earn from work you did or received in payment [retirement benefits, child maintenance, food basket, etc]?
tn: Mo lebakeng la kgwedi le le fetileng, o amogetse madi a a kanang ka eng go tswa mo tirong e o e dirileng kgotsa tuelo e o e amogetseng[ madi a go tlogela tiro, madi a tlhokomelo ya bana, dijo tsa mophako]

source: How many of each type of grant do you receive?
tn: Mo lenaneong lengwe le lengwe o amogela di le kae?

source: Grant name
tn: Leina la lenaneo

source: When was your first positive HIV test result?
tn: Maduo a gago a ntlha a gore o na le mogare wa HIV a ne a le leng?

source: Have you ever received HIV-related medical or clinical care, for such things as a CD4 count (masole), IDCC/ PMTCT registration, additional clinic-based counseling?
tn: tlhatlhobo ya masole a mmele, go kwadisa ko IDCC, lenaneo la PMTCT kgotsa go bona bogakolodi ja tlaleletso kwa kokelong?

source: What is the main reason you have not received HIV-related medical or clinical care?
tn: Ke mabaka a fe gore o bo o sa ise o amogela tlhokomelo ya botsogo ya seemo sa HIV?

source: Have you ever been recommended by a doctor/nurse or other healthcare worker to start antiretroviral therapy (ARVs), a combination of medicines to treat your HIV infection? [common medicines include: combivir, truvada, atripla, nevirapine]
tn: A okile wa gakololwa go simolola diritibatsi(di-ARV), melemo e e kopantsweng go alafa mogare wa HIV? [gantsi go dirisiwa: combivir, truvada, atripla, nevirapine]

source: Have you ever taken any antiretroviral therapy (ARVs) for your HIV infection? [For women: Do not include treatment that you took during pregnancy to protect your baby from HIV]
tn: A okile wa tsaya diritibatsi(di-ARV) dipe go alafa mogare wa gago wa HIV? [Bomme/basadi: O seka wa akaretsa kalfi e o e tsereng ka nako ya boimana go sireletsa ngwana wa gago go tsenwa ke HIV]

source: What was the main reason why you have not started ARVs?
tn: Lebaka legolo ke eng o sa simolola di-ARV?

source: When did you first start taking antiretroviral therapy (ARVs)?
tn: O simolotse go tsaya melemo ya diritibatsi(di-ARV) lantlha leng?

source: Which clinic facility are you already receiving therapy from?
tn: O tsaya melemo ya diritibatsi(di-ARV) ko kokelong efe?

source: When is your next appointment at this facility?
tn: O ya teng gape ko kokelong ka letsatsi lefe?

source: When did you stop taking ARV's?
tn: O ne wa emisa leng go tsaya melemo ya diritibatsi (ARV's)?

source: What was the main reason why you stopped taking ARVs?
tn: Lebaka legolo la go bo o emisitse go tsaya di-ARV ke lefe?

source: During the past 4 days, on how many days have you missed taking all your doses of antiretroviral therapy (ART)?
tn: Mo malatsing a mane a a fetileng, o tlodisitse go tsaya melemo ya gago malatsi a le kae?

source: Thinking about the past 4 weeks, on average, how would you rate your ability to take all your medications as prescribed?
tn: Fa o akanya ka beke tse nne tse di fetileng, fa o akanyetsa o ka kala bokgoni jwa gago jang go tsaya melemo ya gago yotlhe jaaka o laetswe?
