Repository: botswana-combination-prevention-project/bcpp-v1
Catalog: bhp066/locale/tn/LC_MESSAGES/django.po
Languages: tn

source: Have you ever received HIV related medical/clinical care?
tn: A o kile wa amogela tlhokomelo ya botsogo ya HIV?

source: If you have never received HIV related medical/clinical care, why not?
tn: Fa o ise o amogele tlhokomelo ya botsogo ya seemo sa HIV, lebaka ke eng?

source: In the last 3 months, how often did someone take you to the doctor?
tn: Mo kgweding tse tharo tse di fetileng, mongwe o go isitse ngakeng ga kae?

source: When did you first receive HIV-related medical care for such things as a CD4 count (masole), IDCC/ PMTCTregistration, additional clinic-based counseling?
tn: O amogetse leng lantlha tlhokomelo ya bongaka mabapi le seemo sa HIV ya dilo tse di tshwanang go tlhatlhobela masole a mmele, go kwadisa ko IDCC, lenaneo la PMTCT kgotsa go bona bogakolodi ja tlaleletso kwa kokelong?

source: When did you last (most recently) receive HIV-relatedmedical care for such things as a CD4 count (masole), IDCC/ PMTCT registration, additional clinic-based counseling?
tn: O amogetse leng la bofelo(mo bo gaufing) tlhokomelo ya bongaka ya dilo tse di tshwanang tlhatlhobo ya masole a mmele, go kwadisa ko IDCC, lenaneo la PMTCT kgotsa bogakolodi ja tlaleletso kwa kokelong?

source: What was your lowest CD4 (masole) count that was ever measured?
tn: Masole a mmele wa gago a a kileng a nna ko tlase thata e ne e le bokae?

source: What was the main reason why you did not want HIV testing as part of today's visit?
tn: Lebaka legolo la go bo o sa eletse go tlhatlhobela HIV gompieno ke lefe?

source: How many times before today have you had an HIV test?
tn: O itlhatlhobetse HIV ga kae pele ga tsatsi jeno?

source: Where were you tested for HIV, the last [most recent] time you were tested?
tn: O tlhatlhobetswe HIV kae(mo bo gaufing), la bofelo o tlhatlhoba

source: Not including today's HIV test, which of the following statements best describes the reason you were tested the last [most recent] time you were tested before today?
tn: Re sa akaretse tlhatlhobo ya HIV ya tsatsi jeno, ke dife diele tse di tlhalosang botoka lebaka la go bo o ne wa tlhatlhobiwa la bofelo o tlhatlhoba pele ga tsatsijeno?

source: Have you ever been tested for HIV before?
tn: A o kile wa itlhatlhobela HIV mo nakong e e fetileng?

source: When was the last [most recent] time you were tested for HIV?
tn: O tlhatlhobetswe HIV leng(mo bo gaufing), la bofelo o tlhatlhoba

source: Is a record of last [most recent] HIV test [OPD card, Tebelopele, other] available to review?
tn: A mokwalo wa tlhatlhobo ya HIV oteng [karata ya sepatela/clinic, karata ya , Tebelopele,kgotsa sengwe fela] go ka sekwa sekwa?

source: Please tell me the results of your last [most recent] HIV test?
tn: Ke kopa o mpolelele maduo a gago a tlhatlhobo ya gago ya HIV ya bofelo?

source: Do you have any other available documentation of positive HIV status?
tn: A o na le mokwalo ope gape wa maduo a tlhatlhobo ya HIV a a supang gore o na le mogare?

source: Have you ever heard about treatment for HIV with pills called antiretroviral therapy or ARVs [or HAART]?
tn: A o kile wa utlwalela ka kalafi ya dipilisi tsa diritibatsi(di-ARV kgotsa HAART?

source: Do you believe that treatment for HIV with antiretroviral therapy (or ARVs) can help HIV-positive people to live longer?
tn: A o dumela gore kalafi ya di-ARV e ka thusa batho go tshela lebaka le le leele?

source: If you were not tested for HIV in the 12 months prior to today, what is the main reason why not?
tn: Fa o ne o sa tlhatlhobelwa HIV mo dikgweding tse di lesome le bobedi pele ga tsatsijeno, lebaka ke eng?

source: How many total nights did you spend in the hospital in the past 3 months?
tn: O letse palo gotlhe ya masigo a le kae mo sepatela mo kgweding tse tharo tse di fetileng?

source: What was the primary reason for the most recent hospitalization in the past 3 months?
tn: Lebaka le le golo la gore o robadiwe mo sepatela kgwedi tse tharo tse di fetileng e ne e le eng?

source: For this most recent hospitalization, where were you hospitalized?
tn: Ka go robadiwa ga bofelo, o ne o robaditswe kae?

source: For this most recent hospitization, how many nights total did you spend in the hospital?
tn: Ka go robadiwa ga bofelo, o robetse masigo a le kae mo sepatela?

source: How much did you have to pay to the healthcare provider for the entire stay, including any medicines?
tn: O duetse modiri wa botsogo bokae lebaka lotlhe le o le ntseng ko sepatela go akaretsa melemo?

source: For this most recent hospitalization, how long did it take you to get to the hospital?
tn: Ka go robadiwa mo ga bofelo, go go tsere lebaka le le kae go goroga ko sepatela?

source: For this most recent hospitalization, how much did you have to pay for transport, food and accommodation, including fuel if you used your own car?
tn: Ka go robadiwa mo ga bofelo, o duetse bokae e le madi a sepalamo, dijo le boroko, go akaretsa leokwane kgotsa petrol fa o dirisitse koloi ya gago?

source: For this most recent hospitalization, were any of these costs by covered by anyone else, such as your medical aid or employer?
tn: Ka go robadiwa mo ga bofelo, a dingwe tsa di tshenyegelo tse o di thusitswe ke mongwe, jaaka medical aid kgotsa mohiri wa gago?

source: Are you currently employed?
tn: A o a bereka?

source: In the past 3 months, how many times have you changed your job? For example, changed your type of work or your employer.
tn: Mo dikgweding tse tharo tse di fetileng, o fetotse tiro ya gago ga kae? Sekai, o fetotse mofuta wa tiro e o e dirang kgotsa mohiri.

source: In the past month, how many days did you work?.
tn: Mo lebakeng la kgwedi le le fetileng, o berekile malatsi a le kae?

source: In the past month, what was your income?
tn: Mo lebakeng la kgwedi le le fetileng, o amogetse bokae?

source: How were you paid for your work?
tn: O dueletswe tiro ya gago jang?

source: In the past month, what was the income of your household?
tn: Mo lebakeng la kgwedi le le fetileng, madi a a tsileng mo lwapeng e ne e le boake?

source: If you are not currently doing anything to earn money, then are you:
tn: Fa mo bo gompienong o sa dire sepe go dira madi, go raya gore o:

source: Do you receive any government grant for yourself or on behalf of someone else?
tn: A o amogela thuso nngwe go tswa mo pusong kgotsa mo boemong jwa mongwe (grants)?

source: In the past month, how many nights did you spend away from home?.
tn: Mo lebakeng la kgwedi le le fetileng, o robetse masigo a le kae ko ntle ga lelwapa?

source: In the last 12 months, have you spent more than 2 weeks away?
tn: Mo kgweding tse di lesome le bobedi, a o kile wa nna lobaka lwa beke tse pedi kwa ntle?

source: How many days have you been prevented from working because of sickness or visits to seek healthcare in the last 3 months.
tn: Ke malatsi a le kae a o neng o sa kgona go bereka ka ntlha ya bolwetsi kgotsa go batla dithuso tsa botsogo mo kgweding tse tharo tse di fetileng.

source: How many days have you been prevented by illness from doing the things you normally do (studying, housework etc.) because of sickness or visits to seek healthcare in the last 3 months?
tn: Ke malatsi a le kae a o sa kgonang go dira ditiro tsa tlwaelo (go ithuta, ditiro tsa mo lwapeng jalo, jalo)ka ntlha ya bolwetsi kgotsa ka ntlha ya maeto a botsogo mo dikgweding tse tharo tse di fetileng?

source: Do you recall or is there a record of having any of the following serious illnesses?
tn: A o a gakologelwa kgotsa a o na le karata ya bongaka/ ya sepatela e e supang gore o kile wa nna le bonngwe jwa malwetsi a a latelang?

source: Is a record (OPD card, discharge summary) of a heart disease or stroke diagnosis available to review?
tn: A mokwalo(karata ya bongaka, mokwalo wa fa o ntshiwa mo sepatela) wa go tlhomamisa bolwetse ja pelo kgotsa jwa go swa mhama oteng go sekwasekwa?

source: Is a record (OPD card, discharge summary) of a cancer diagnosis available to review?
tn: A mokwalo(karata ya bongaka, mokwalo wa fa o ntshiwa mo sepatela) wa go tlhomamisa bolwetse ja kankere o teng go sekwasekwa

source: Is a record (OPD card, discharge summary, TB card) of a tuberculosis infection available to review?
tn: A mokwalo(karata ya bongaka, mokwalo wa fa o ntshiwa mo sepatela) wa go tlhomamisa bolwetse ja TB oteng go sekwasekwa?

source: Do you wish to have a child now or in the future?
tn: A o na le keletso ya go nna le ngwana gompieno kgotsa nako e e tlang?

source: In the last 3 months, did you seek care at a Government Primary Health Clinic/Post? Not including any visits for which you were hospitalized.
tn: Mo kgweding tse tharo tse di fetileng, a okile wa batla bongaka ko kokelong kgotsa kokelwana ya ga goromente? Re sa akaretse maeto a o neng wa robatswa.

source: In the last 3 months, did you seek care at a Hospital Outpatient Department, including Govt, private and church/mission hospitals? Not including any visits for which you were hospitalized.
tn: Mo kgweding tse tharo tse di fetileng a o kile wa batla thuso ya bongaka jo o sa robadiweng, go akaretsa sepatela sa ga goromente, sa private le sa mission/kereke? Re sa akaretse maeto a o neng o robaditswe.

source: In the last 3 months, did you seek care from a Private Doctor?
tn: Mo kgweding tse tharo tse di fetileng, a o kile wa tlhoka thuso ko ngakeng ya Private?

source: In the last 3 months, did you seek care from a Traditional or Faith Healer?
tn: Mo kgweding tse tharo tse di fetileng, a o kile wa tlhoka thuso ko ngakeng ya setso kgotsa ya semoya?

source: In the last 3 months, how many total outpatient visits have you to all of the above places?
tn: Mo kgweding tse tharo tse di fetileng, o ile maeto a le kae ko go bonwang balwetsi ba ba sa robadiweng?

source: For the most recent outpatient medical care visit in the past 3 months, which type of facility did you visit?
tn: Ka loeto la bofelo la bongaka jo o sa robadiweng mo kgweding tse tharo tse di fetileng, o etetse lefelo le fe?

source: For this most recent visit to a Government Primary Health Clinic/Post, which clinic did you visit?
tn: Ka loeto le la bofelo ko kokelong ya ga goromente, o etetse kokelo e fe?

source: For this most recent medical care visit, what was the primary reason you sought care?
tn: Ka loeto le la bofelo la tlhokomelo ya bongaka, lebaka legolo la go batla bongaka e ne e le eng?

source: For this most recent outpatient medical care visit, how much did you have to pay to the health care provider, including any medicines?
tn: Ka loeto le la bofelo la bongaka jo o sa robadiweng, o duetse modiri wa botsogo bo kae, go akaretsa le melemo?

source: For this most recent outpatient medical care visit, how long did it take you to get to the clinic?
tn: Ka loeto le la bofelo la bongaka jo o sa robadiweng, o tsere lebaka le le kae go goroga ko kokelong?

source: For this most recent outpatient medical care visit, how much did you have to pay for transport, food and accommodation? [include cost for fuel if using a private car]
tn: Ka loeto le la bofelo la bongaka jo o sa robadiweng, o duetse bokae e le madi a sepalamo, dijo le boroko? [go akaretsa madi a leokwane/petrol fa o dirisa koloi ya gago]

source: For this most recent outpatient medical care visit, were any of these costs by covered by anyone else, such as your medical aid or employer?
tn: Ka loeto le la bofelo la ko sepatela la bongaka jo o sa robadiweng, a go na le le mongwe yo o go thusang ditshenyegelo, jaaka medical aid kgotsa mohiri wa gago?

source: For this most recent outpatient medical care visit, how long did you have to wait before you were seen, from when you arrived at the facility?
tn: Ka loeto le la bofelo la sepatela la bongaka jo o sa robadiweng, o letile lebaka le le kae pele o bonwa?

source: I think less of myself.
tn: Ga ke ipone ke le motho wa sepe.

source: I have felt ashamed because of having HIV.
tn: Ke ne ka ikutlwa ke tlhabiwa ke ditlhong gore ke na le HIV.

source: I fear that if I disclosed my HIV status to my friends, they would lose respect for me.
tn: Ke tshoga gore fa ke ka ka bolelela ditsala tsame seemo same sa HIV, ba tla seke ba tlhole ba ntlotla

source: I fear that if I disclosed my HIV status to my family, they would exclude me from usual family activities.
tn: Ke tshoga gore fa ke ka ka bolelela ba lelwapa lame seemo same sa HIV, ba tla seke ba tlhole ba ntsenya mo ditirong tsa lelwapa tsa malatsi otlhe

source: People have talked badly about me.
tn: Batho ba ne ba bua bosula ka nna.

source: I have lost respect or standing in the community.
tn: Ke latlhegetswe ke maemo kgotsa tlotlo mo motseng..

source: I have lost a job because of having HIV.
tn: Ke senyegetswe ke tiro ka lebaka la gonna le mogare wa HIV.

source: Have you registered for antenatal care?
tn: A o ikwadiseditse boimana?

source: When was the first day of your last normal menstrual period?
tn: O bone leng setswalo se se siameng la bofelo?

source: Mobility
tn: Go kgona go tsamaya

source: Self-Care
tn: Go kgona go itlhokomela

source: Usual Activities (e.g. work, study, housework, family or leisure activities)
tn: Ditiro tsa gale (jaaka: tiro/ go bereka, go tsena sekolo/ go ithuta, tiro ya mo lapeng, go nna le ba lelwapa kgotsa go itosa bodutu)

source: Pain / Discomfort
tn: Ga ke na ditlhabi kgotsa go sa ikutlwe sentle

source: Anxiety / Depression
tn: Go tlhobaela / Maikutlo a wetseng kwa tlase(Depression)

source: We would like to know how good or bad your health is TODAY. This scale is numbered from 0 to 100. 100 means the 'best' health you can imagine. 0 means the 'worst' health you can imagine. Indicate on the scale how your health is TODAY.
tn: Re tla batla goitse gore botsogo ja gago bosiame kgotsa bo maswe go le kae TSATSI JENO. Sekale se se dirisa gotsa kwa go 0 go tsena ko go 100. 100 o raya gore botsogo jo bontle thata jo o ka bo akanyang. 0 o raya botsogo jo bo maswe jo o ka bo akanyang. Supa mo sekaleng gore botsogo ja gago bo ntse jang TSATSI JENO.

source: Reason for referral
tn: Lebaka la go romelwa

source: How many children have you given birth to? Please include any children that may have died at (stillbirth) or after birth. Do not include any current pregnancies or miscarriages that occur early in pregnancy (prior to 20 weeks).
tn: O tshotse bana ba le kae? [Tswee-tswee akaretsa bana ba ba ka tswang ba tlhokafetse ka nako ya pelegi morago ga go belegwa, mme o seka wa tsenya boimana bope ja gompieno kgotsa go senyegelwa mo go diragalang fa boimana bo simologa(pele ga beke tse 20)]

source: Have you reached menopause (more than 12 months without a period)?
tn: A o emisitse go bona setswalo (go feta kgwedi tse di lesome le bobedi o sa bone setswalo)?

source: In the past 12 months, have you used any methods to prevent pregnancy ?
tn: Mo kgweding tse di lesome le bobedi, a okile wa dirisa mofuta mongwe go thibela boimana (supa tsotlhe tse di lebaneng)?

source: Are you currently pregnant?
tn: A o moimana gompieno?

source: How long have you lived in this community?
tn: O na le lebaka le le kae o nna mo motseng o?

source: In the past 12 months, have you typically spent 14 or more nights per month in this community?
tn: Mo lebakeng la kgwedi tse di lesome le bobedi tse di fetileng, a okile wa nna masigo a le lesome le bone kgotsa go feta ka kgwedi mo motseng o?

source: In the past 12 months, in total how many nights did you spend away from this community, including visits to cattle post and lands?[If you don't know exactly, give your best guess]
tn: Mo lebakeng la kgwedi tse di lesome le bobedi tse di fetileng ke palo gotlhe ya masigo a le kae a o a letseng kwantle ga mono, go akaretsa go ya/ go etela kwa morakeng le masimo?[ Fa o sa itse palo ka tlhomamo, o ka akanyetsa fela]

source: In the past 12 months, during the times you were away from this community, where were you primarily staying?
tn: Mo kgweding tse di lesome le bobedi tse di fetileng, mo dinakong tse o neng o seyo mono, a o ne o nna thata kwa?

source: Give the name of the community
tn: Leina la motse oo

source: In the last 3 months, have you sought outpatient medical care for yourself? Not including any visits for which you were hospitalized.
tn: Mo kgweding tse tharo tse di fetileng, a o kile wa batla thuso ya bongaka jo o sa robadiweng? Re sa akaretse maeto a o neng o robaditswe.

source: In the last 3 months, how many times were you admitted to hospital or other types of inpatient care and stayed one or more nights? This could be a government, private, or church/mission hospital.
tn: Mo kgweding tse tharo tse di fetileng, o robaditswe ga kae mo sepatela kgotsa mofuta wa lefelo le go robadiwang balwetsi bosigo bo le bongwe kgotsa go feta? E ka nna sepatela sa puso/ private, sa kereke kgotsa mission?

source: Were any of these costs for medicines or special foods covered by anyone else, such as your medical aid or employer?
tn: A dingwe tsa ditshenyegelo tse tsa melemo kgotsa dijo tse di faphegileng o di thusitswe ke mongwe, jaaka medical aid kgotsa mohiri wa gago?

source: In your lifetime, have you ever had sex with anyone (including your spouse, friends, or someone you have just met)?
tn: Mo botshelong jwa gago, a o kile wa tlhakanela dikobo le mongwe (go akaretsa le monna/mosadi wa gago, tsala kgotsa mongwe yo o sa tswang go kopana le ene)?

source: In the past 12 months, how many different people have you had sex with? Please remember to include casual and once-off partners (prostitutes and truck drivers) as well as long-term partners (spouses, boyfriends/girlfriends)[If you can't recall the exact number, please give a best guess]
tn: Ke palo gotlhe ya batho ba le kae ba ba farologaneng ba o tlhakanetseng dikobo le bone mo lebakeng la kgwedi tse di lesome le bobedi tse di fetileng? Tswee-tswee o akaretse bakapelo ba nakwana kgotsa ba gone foo( ba ba gwebang ka mmele le bakgweetsi ba dikoloi tsa megobagoba) ga mmogo le bakapelo ba lebaka le le leele ( monna/mosadi wa gago; boyfriend/girlfriend) [Fa o sa gakologelwe palo ka tlhomamo, akanyetsa fela]

source: In the past 12 months, did you have sex with somebody living outside of the community?
tn: Mo lebakeng la kgwedi tse di lesome le bobedi tse di fetileng a okile wa tlhakanela dikobo le mongwe yo o sa nneng mo motseng o?

source: How old were you when you had sex for the first time? [If you can't recall the exact age, please give a best guess]
tn: O tlhakanetse dikobo lantlha o le dingwaga di kae [Fa o sa gakologelwe sentle, akanyetsa fela]?

source: During the last [most recent] time you had sex, did you or your partner use a condom?
tn: La bofelo le tlhakanela dikobo( mo bo gaufing) a wena le mokapelo wa gago le dirisitse sekausu/condom?

source: During the last [most recent] time you had sex, were you or your partner drinking alcohol?
tn: Ka tlhakanelo dikobo ya bofelo, a wena kgotsa mokapelo wa gago le ne le nwa bojalwa?

source: Would you be, or have you ever been, hesitant to take an HIV test due to fear of people's reaction if you tested positive for HIV.
tn: A o a tshaba, kgotsa a o kile wa tshaba, go itlhatlhobela HIV ka letshogo la gore batho ba tlaa reng fa o ka fitlhelwa o na le mogare wa HIV.

source: I would be ashamed if someone in my family had HIV.
tn: Ke kwa swaba fa mongwe mo lwapeng larona a ka nna le HIV.

source: I fear that I could contract HIV if I come into contact with the saliva of a person living with HIV.
tn: Ke tshaba gore ke ka tsenwa ke mogare wa HIV fa ke ka amana le mathe a motho yo o tshelang le HIV

source: I think that if a teacher is living with HIV but is not sick, he/she should be allowed to continue teaching in the school.
tn: Ke akanya gore fa morutabana a tshela le HIV mme a sa lwale, a letlelelwe go tswelela a ruta mo sekolong.

source: Children living with HIV should be able to attend school with children who are HIV negative.
tn: Bana ba ba tshelang le HIV ba tshwanetse go tsena sekolo le bana ba ba senang HIV

source: People are hesitant to take an HIV test due to fear of people's reaction if the test result is positive for HIV.
tn: Batho ba tshaba go tlhatlhobela HIV ka go poifo ya gore batho ba tlaa reng fa maduo a ka supa ba na le mogare wa HIV.

source: People talk badly about people living with or thought to be living with HIV to others.
tn: Batho ba bua le ba bangwe bomaswe ka batho ba ba nang le HIV kgotsa ba go akanngwang ba na le HIV

source: People living with or thought to be living with HIV lose respect or standing.
tn: Batho ba ba tshelang le HIV kgotsa ba go akanngwang ba na le HIV ga ba tlotliwe kgotsa ga ba bone maemo.

source: People living with or thought to be living with HIV are verbally insulted, harassed and/or threatened.
tn: Batho ba ba tshelang le HIV kgotsa ba go akanngwang ba na le HIV ba a rogwa, thorontshiwa kgotsa ba a tshosediwa ka dipuo.

source: People living with or thought to be living with HIV are sometimes physically assaulted.
tn: Batho ba ba tshelang le HIV kgotsa go akanngwa ba na le HIV fa gongwe ba kgokgontshiwa ka go itewa/ go betswa.

source: People living with or thought to be living with HIV are now more accepted by others as there is now an effective treatment available.
tn: Batho ba ba tshelang le mogare wa HIV kgotsa go akanngwa gore ba na le mogare wa HIV ba a amogelesega mo go ba bangwe ka gompieno go na le kalafi

source: People living with HIV are less able to financially support themselves and their families.
tn: Batho ba ba nang le mogare wa HIV ba na le bothata ja madi go ka itlhokomela kgotsa go tlhokomela ba malapa a bone

source: In the past month, how often did you consume alcohol?
tn: Mo lebakeng la kgwedi le le fetileng, o nole bojalwa ga kae? [Fa o sa itse ka tlhomamo, akanyetsa fela.]

source: Do you currently smoke any tobacco products, such as cigarettes, cigars, or pipes?
tn: A mo bogompienong o goga dingwe tsa ditswa motsokong, jaaka sekerese,cigar, kgotsa peipi?

source: What is the main reason that you have not yet been circumcised?
tn: Lebaka le legolo la gore o bo o sa rupisiwa ke eng?

source: Would you ever consider being circumcised in the future?
tn: A o ka akanya kgotsa wa nna le kgatlhego ya go rupa mo nakong e e tlang?

source: Which of the following might increase your willingness to be circumcised the most?
tn: Ke eng sa tse di latelang se se ka oketsang thata keletso ya gago ya go rupa?

source: Were you aware that circumcision services are provided free of charge at most health facilities?
tn: A o ne o lemoga gore ditirelo tsa go rupa di fiwa mahala mo dikokelong ka bontsi?

source: Where did you learn that circumcision services were available free at most health facilities?
tn: O utlwile kae gore ditirelo tsa go rupa di teng mahala mo dikokelong ka bontsi?

source: ...if "Other", specify
tn: Tse dingwe, tlhalosa

source: Date of Birth
tn: Letsatsi la matsalo

source: Name
tn: Leina

source: Male
tn: Monna

source: Female
tn: Mosadi

source: Undetermined
tn: Ga go tlhomamisege

source: Positive
tn: O na le mogare (positive)

source: Negative
tn: Ga a na mogare (negative)

source: Unknown
tn: Ga go itsiwe (unknown)

source: Home
tn: Ko lwapeng

source: Study Start Date and Time
tn: Protocol title used on the grant

source: Gender
tn: Bong

source: Use grading scale 1-5, where 5 is death
tn: Dirisa sekala sa bongwe go ya botlhano, botlhano e le loso

source: Identity number (OMANG, etc)
tn: OMANG

source: Mailing address
tn: Aterese ya poso

source: Physical address with detailed description
tn: Tlhalosa ko o nnang teng ka botlalo

source: Telephone
tn: Mogala

source: Telephone (alternate)
tn: Mogala (o mongwe)

source: Name and location of work place
tn: Leina le lehelo ko o berekang teng

source: Work telephone number
tn: Mogala wa ko tirong

source: Full names of the contact person
tn: Maina ka botlalo a mongwe o go ka ikopanngwang le ene

source: Full physical address
tn: Ko o nnang teng ka botlalo
