Repository: botswana-combination-prevention-project/bcpp-v1
Catalog: bhp066/locale/tn/LC_MESSAGES/django.po
Languages: tn

source: Is date of birth estimated?
tn: A letsatsi la matsalo le akanyeditswe?

source: First name
tn: Leina la gago

source: Last name
tn: Sefane sa gago
