Repository: botswana-combination-prevention-project/bcpp-v1
Catalog: bhp066/locale/tn/LC_MESSAGES/django.po
Languages: tn

source: Yes
tn: Ee

source: No
tn: Nnya

source: Don't want to answer
tn: Ga ke eletse go araba

source: Not Sure
tn: Ga ke tlhomamise

source: Do not Know
tn: Ga ke itse

source: Refused to answer
tn: Ga a eletse go araba

source: Strongly disagree
tn: Ga ke dumalane gotlhelele

source: Disagree
tn: Ga ke dumalane

source: Uncertain
tn: Ke a etsaetsega

source: Agree
tn: Ke a dumela

source: Strongly agree
tn: Ke dumalana mo go tseneletseng

source: Days
tn: Malatsi

source: Months
tn: Dikgwedi

source: Years
tn: Dingwaga

source: Less than 6 months
tn: Kwa tlase ga kgwedi tse thataro(6)

source: 6 months to 12 months
tn: Kgwedi tse thataro go ya go tse di lesome le bobedi

source: 1 to 5 years
tn: Ngwaga go ya go tse tlhano

source: More than 5 years
tn: Go feta ngwaga tse tlhano

source: Zero nights
tn: Ga gona

source: 1-6 nights
tn: Bosigo bo le bongwe go ya kwa go a le marataro

source: 1-2 weeks
tn: Beke e le nngwe go ya ko go tse pedi

source: 3 weeks to less than 1 month
tn: Beke tse tharo go ya ko go tse nne

source: 1-3 months
tn: Kgwedi e le nngwe go ya ko go tse tharo

source: 4-6 months
tn: Kgwedi tse nne go ya ko go tse thataro

source: more than 6 months
tn: Go feta kgwedi tse thataro

source: I am not sure
tn: Ga ke tlhomamise

source: Not Applicable
tn: Ga go kgonege

source: Farm/lands
tn: Kwa polaseng/masimo

source: Cattle post
tn: Morakeng

source: Other community, specify:
tn: Motse o sele, tlhalosa

source: Other non study community
tn: Motse o o sele e seng wa tshekatsheko e

source: Very active
tn: Ke tlhaga thata

source: Somewhat active
tn: Ke a leka go nna tlhaga

source: Not active at all
tn: Ga ke tseye karolo gotlhelele

source: Not applicable (no election, can't vote)
tn: Go ne go sena ditlhopho, ga ke kgone go tlhopha

source: Don't know
tn: Ga ke itse

source: Pentecostal
tn: Methodist

source: Other
tn: Tse dingwe

source: Other, specify:
tn: Tse dingwe, tlhalosa:

source: Single/never married
tn: Ga ke a nyalwa/nyala/ ga keise ke ko ke nyalwe/nyale

source: Married (common law/civil or customary/traditional)
tn: Ke nyetswe/nyetse (kwa ga molaodi kgotsa ka setswana le ko kgotleng tota)

source: Divorced or formally separated
tn: Ke kgaogane le mosadi/monna ka fa molaong

source: Widowed
tn: Ke swetswe

source: Non formal
tn: Thuto ga e golelwe

source: Primary
tn: Sekolo se se botlana

source: Higher than senior secondary (university, diploma, etc.)
tn: Go feta sekolo se se golwane (university, diploma, le tse dingwe fela jalo)

source: Not working
tn: Ga ke bereke

source: Yes in the Government Sector (full time)
tn: Ee, mo makalaneng a puso (ke theogela malatsi)

source: Yes in the Private Sector (full time)
tn: Ee mo makalaneng a ikemetseng ka nosi (ke thelogela malatsi otlhe)

source: Yes self-employed working on my own
tn: Ee ke a ipereka, ke bereka ke le nosi

source: Yes self-employed working with employees
tn: Ee ke a ipereka ke na le babereki

source: Yes part-time/ intermittently
tn: Ee, e ke sa theogeleng malatsi otlhe

source: Informal self-employment
tn: Go ipereka

source: Student
tn: Ke tsena sekolo

source: Pensioner (retired)
tn: Go tlogela tiro ka bogodi

source: I already knew I am HIV positive
tn: Ke setse ke itse gore ke na le mogare wa HIV positive

source: I recently tested (I know my status)
tn: Ke tlhatlhobile, ke itse seemo same

source: I didn't believe I was at risk of getting HIV
tn: Ke ne ke sa dumele gore ke mo diphatseng tsa go tsenwa ke HIV

source: I am afraid to find out the result
tn: Ke na le letshogo la go itse maduo

source: I am afraid of what others would think of me
tn: Ke na le letshogo la gore batho ba tla reng ka nna

source: Family/friends did not want me to get an HIV test
tn: Ba lelwapa/masika ba ne ba sa batle ke itlhatlhobela HIV

source: I didn't have time due to work
tn: Ke ne ke sena nako ka lebaka la tiro

source: I didn't have time due to family obligations
tn: Ke ne ke sena nako ka lebaka la ditshwarego tsa lelwapa

source: My sexual partner did not want me to get an HIV test
tn: Mokapelo wa me wa tlhakanelo dikobo o ne a sa batle ke itlhatlhobela HIV

source: In the last month
tn: Mo lebakeng la kgwedi le le fetileng

source: 1 to 5 months ago
tn: Kgwedi e le nngwe go ya ko go tse tlhano tse di fetileng

source: 6 to 12 months ago
tn: Kgwedi tse thataro go ya go tse di lesome le bobedi tse di fetileng

source: more than 12 months ago
tn: Kwa tlase ga kgwedi tse thataro

source: HIV Positive
tn: O na le mogare (positive)

source: HIV Negative
tn: Ga o na mogare (negative)

source: Tebelopele VCT center
tn: Ko Tebelopele

source: Antenatal care at healthcare facility (including private clinics)
tn: Ko kokelong ya baimana (go akaretsa ya private)

source: Other (not antenatal care) at healthcare facility (including private clinics)
tn: Ko kokelong (e seng ya baimana) ya botsogo (go akaretsa ya private)

source: In my house as part of door-to-door services
tn: Mo lapeng lame e le bontlha bongwe jwa ditirelo tsa ntlo le ntlo

source: In a mobile tent or vehicle in my neighborhood
tn: Mo tanteng kgotsa koloi e e tsamayang e tlhatlhoba mo motseng

source: I was worried I might have HIV and wanted to know my status
tn: Ke ne ke tshwenyegile ke re gongwe ke na le HIV jaanong ke batla goitse seemo sa me

source: I heard from someone I trust that it is important for me to get tested for HIV
tn: Ke ne ka utlwa ka mongwe yo ke mo tshephang gore go botlhokwa go itlhatlhobela HIV

source: I was at a health facility where the doctor/nurse recommended I get tested for HIV during the same visit
tn: Ke ne ke le kwa kokelong mme mooki/ngaka a nkgakolola gore ke ka itlhatlhobela HIV nako eo

source: I read information on a brochure/flier that it is important for me to get tested for HIV
tn: Ke badile mo di pampitshaneng tsa dikitsiso gore go botlhokwa go itlhatlhobela HIV

source: Yes, specify:
tn: Ee, tlhalosa:

source: No, any time of day is fine
tn: Nnyaa, nako nngwe le nngwe mo letsatsing e ntshiametse

source: No, any day of the week is fine
tn: Nnyaa, nako nngwe le nngwe mo bekeng e ntshiametse

source: No, any month is fine
tn: Nnyaa, nako nngwe le nngwe mo kgweding e ntshiametse

source: At my home
tn: Mo lapeng lame

source: At a mobile testing tent or vehicle in my neighborhood
tn: Mo tlhatlhobong e e fiwang ko di tanteng kgotsa dikoloi tse di etelang mo tikologong ya rona

source: At a health facility in my community
tn: Kokelo kgotsa sepatela se eseng sa puso mo motseng o

source: At a health facility or mobile testing unit outside of my community
tn: Ko kokelong kgotsa koloi e e tsamayang e e kwa ntle ga motse wa rona

source: Neither of us
tn: ope wa rona

source: My partner
tn: mokapelo wame

source: Myself
tn: nna

source: Both of us
tn: Rotlhe ka bobedi

source: In this community
tn: Mo motseng o

source: On farm/cattle post that is part of this community
tn: Ko masimong/ morakeng kwa ntel ga motse wa rona

source: Outside this community
tn: E seng mo motseng o

source: Both in this community and outside this community
tn: Gotlhe mo motseng wa rona le kwa ntle ga motse wa rona

source: Long-term partner (>2 years) or spouse
tn: Mokapelo wa lebaka le le leele (wa go feta ngwaga tse pedi) kgotsa monna/mosadi wa gago

source: Boyfriend/Girlfriend
tn: Mokapelo(Boyfriend/Girlfriend)

source: Casual (known) partner
tn: Mokapelo wa nakwana (o moitse)

source: One time partner (previously unknown)
tn: Mokapelo wa nakwana (yo o neng a sa itsiwe pele)

source: Commercial sex worker
tn: Modiri yo gwebang ka mmele

source: HIV-positive
tn: O na le mogare (positive)

source: HIV-negative
tn: Ga o na mogare (negative)

source: I am not sure HIV status
tn: Ga ke tlhomamise

source: Did not know my HIV status
tn: Ke ne sa itse seemo same sa HIV

source: less or equal to 18 years old
tn: dingwaga tse 18 go ya ko tlase

source: 19-29 years old
tn: dingwaga tse 19-29

source: 30-39 years old
tn: dingwaga tse 30-39

source: 40-49 years old
tn: dingwaga tse 40-49

source: 50-59 years old
tn: dingwaga tse 50-59

source: All of the time
tn: Ka dinako tsotlhe

source: Sometimes
tn: Fa gongwe

source: Never
tn: Le eseng tsatsi lepe

source: 2 years) or spouse
tn: ngwaga tse pedi kgotsa motho yo o nyalaneng le ene

source: I did not know my HIV status
tn: Ke ne sa itse seemo same sa HIV

source: 500 or more
tn: 500 kana go feta

source: Did not feel sick
tn: Ke ne ke sa ikutlwe ke lwala

source: Did not know I should get HIV care
tn: Ke ne ke sa itse gore ke tshwanetse go bona tlhokomelo ya HIV

source: Did not have time due to work responsibilities
tn: Ke ne ke sena nako ka lebaka la tiro

source: Did not have time due to family/childcare responsibilities
tn: Ke ne ke sena nako ka lebaka la ditshwarego tsa lelwapa/tlhokomelo ya bana

source: Transportation costs
tn: Ditshenyegelo tsa sepalamo

source: Was afraid of someone (friends/family) seeing me at the HIV clinic
tn: Ke ne ke tshaba mongwe(ditsala/ba lelwapa) go mpona kwa kokelong ya HIV

source: Traditional healer advised against going
tn: Ngaka ya setso o nkgakolotse gore ke seka ka tsamaya

source: Religious beliefs
tn: Mabaka a tsa tumelo

source: Cultural beliefs
tn: Mabaka a tsa ngwao

source: Was afraid treatment would make me feel bad/sick
tn: O ne a tshaba gore kalafi e tlaa mo lwatsa

source: Difficulty finding someone to go with me for counseling (mopati)
tn: Ga ke a kgona go bona mopati go ya bogakoloding le nna

source: Hard due to work responsibilities
tn: Ke ne ke sena nako ka mabaka a tiro

source: Hard due to family/childcare responsibilities
tn: Ke ne ke sena nako ka mabaka a boikarabelo ja lelwapa/ tlhokomelo ya bana

source: Sexual partner advised against taking
tn: Mokapelo o nkgakolotse gore ke seka ka tsamaya

source: Family or friends advised against taking
tn: Ba lelwapa kgotsa ditsala ba nkgakolotse gore ke seka ka tsamaya

source: Traditional healer advised against taking
tn: Ngaka ya setso o nkgakolotse gore ke seka ka tsamaya

source: Did not feel they were helping
tn: Ke ne ke bona di sa thuse

source: ARVs made me feel bad or sick
tn: Diritibatsi di ne di ntwatsa

source: Doctor or nurse at clinic told me to stop
tn: Ngaka kgotsa mooki ko kokelong o rile ke emise

source: Zero days
tn: Ga gona malatsi a ke tlodisitseng

source: One day
tn: Letsatsi le lengwe

source: Two days
tn: Malatsi a le mabedi

source: Three days
tn: Malatsi a le mararo

source: Four days
tn: Malatsi a le mane

source: Very poor
tn: Go maswe thata/ Very poor

source: Poor
tn: Go maswe/ Poor

source: Fair
tn: Ga go maswemaswe/ Fair

source: Good
tn: Go gontle/ Good

source: Very good
tn: Go gontle thata/ Very good

source: Circumcision never offered to me
tn: Ga ke a fiwa sebaka sa gore ke ka rupa

source: Procedure might be painful
tn: Tsamaiso ya rupa e ka nna ya bo e le botlhoko

source: Did not know where to go for circumcision
tn: Ke ne ke saitse gore ke ka ya kae go ya go rupa

source: Did not have the time or money for circumcision
tn: Ke ne ke sena nako le madi a go rupa

source: I might not be able to work or be active
tn: Ke ka nna ka seka ka kgona go bereka sentle kgotsa go nna matlhagatlhaga

source: My partner might not approve
tn: Mokapelo wa me o ka nna aseka a amogela kgotsa a ntetlelela

source: My family/friends might not approve
tn: Ba lelwapa lame/ditsala ba ka nna ba seka ba ntetlelela

source: There might be a medical complication
tn: Go ka nna ga nna le ditlamorago tsa botsogo

source: The healing time is very long
tn: Go tsaya lebaka le le leele go fola

source: It will be hard to not have sex or masturbate for 6 weeks
tn: Go tla nna thata go nna ke sa tlhakanele dikobo kgotsa go iphoraphora bonna( masturbate) beke tse thatataro

source: Sex might not feel the same
tn: Tlhakanelo dikobo e ka nna ya seka ya tshwana le pele

source: I may not like the way my penis looks
tn: Ke ka nna ka seka ka rata ka fa bonna/ thupa yame e lebegang ka teng

source: I may not like the way my penis feels
tn: Ke ka nna ka seka ka rata ka fa bonna/thupa ya me e utlwalegang ka teng

source: I could die from the procedure
tn: Ke kgona go swa fa ke dirwa tsamaiso ya go rupa

source: More information about benefits
tn: Kitso e nngwe/ e e oketsegileng ka dipoelo/ mosola

source: More information about risks
tn: Kitso e nngwe/ ee e oketsegileng ka bodiphatsa

source: If there was no or minimal pain with circumcision
tn: Fa go ne go se botlhoko kgotsa go le botlhokonyana

source: If circumcision could be done close to my home
tn: Fa ke ne ke ka rupa gaufi le ko lwapeng

source: If the kgosi recommended circumcision for all men
tn: Fa kgosi a rotloetsa gore borre botlhe ba rupisiwe

source: If I received time off work to recover from circumcision
tn: Fa ke ka bona ya go ikoka ke sa ye tirong

source: If my sexual partner encouraged me
tn: Fa mokapelo wame wa tlhakanelo dikobo a ka nthotoetsa

source: If one or both of my parents encouraged me
tn: Fa mongwe wa batsadi kgotsa batsadi botlhe ba ka nthotoetsa

source: If my friends encouraged me
tn: Fa ditsala tsame di ka nthotoetsa

source: Radio
tn: Seromamowa

source: Friend told me
tn: Tsala e mpoleletse

source: Family told me
tn: Ba lelwapa ba mpoleletse

source: Health worker told me
tn: Modiri wa botsogo o mpoleletse

source: Kgosi told us
tn: Kgosi o re boleletse

source: I heard it at the kgotla
tn: Ke utlwile ko kgotleng

source: I read a brochure delivered to my home
tn: Ke badile pampitshana e e tlisitsweng ko lwapeng (brochure)

source: I read it in the newspaper
tn: Ke badile mo pampiring ya dikgang

source: Heard it at a community event
tn: Ke utlwile ko tirong ya mo motseng

source: Government clinic or hospital
tn: Kokelo kgotsa sepatela sa puso

source: Traditional location (Bogerwa)
tn: Lohelo lwa Setwana (bogwera)

source: Outreach site (mobile or temporary center)
tn: Lehelo la tlhotlhobelo la nakwana

source: Private practitioner
tn: Ngaka wa Private

source: Prevent HIV/AIDS
tn: Thibelo ya HIV/AIDS

source: Other medical reason
tn: Lebaka le lengwe la botsogo

source: Personal preference
tn: Se nna ke se ratang

source: Improved hygiene
tn: Koketsego ya bophepa

source: Cultural tradition and/or religion
tn: Ngwao le/ kgotsa Tumelo

source: Acceptance by sexual partner(s)
tn: Kamogelo ke mokapelo (bakapelo)

source: Acceptance by family, friends, and/or community
tn: Kamogelo ke ba lelwapa/ ditsala, le/kgotsa batho ba motse

source: No, not sexually active and will not become sexual active
tn: Nnyaa, ga ke tlhakanele dikobo e bile ga ke kake ka tlhakanela dikobo

source: No, prior surgical sterilization
tn: Nnyaa, ke setse ke dirile loaro la go ikemisa

source: No, partner(s) surgically sterilized
tn: Nnyaa, mokapelo (bakapelo) o setse a dirile loaro la go ikemisa

source: No, post-menopause (at least 24 consecutive months without a period)
tn: Nnya, ke emisitse go bona setswalo (ngwaga tse pedi ka go tlhomagana ke sa bone setswalo)

source: No, but I will go for antenatal care
tn: Nnya, mme ke tla ikwadisetsa tlhokomelo ya boimana?

source: No and I am not planning on going for antenatal care
tn: Nnyaa, ga ke na maikaelelo a go ya tshidilo ya baimana

source: Yes, AZT (single drug, twice a day)
tn: Ee, AZT (molemo o le mogwe, ga bedi ka letsatsi)

source: Yes, HAART [multiple drugs like Atripla, Truvada, or Combivir taken once or twice a day]
tn: Ee, HAART (melemo e e farologanyeng jaaka Atripla, Truvada, kgotsa Combivir e tsewa gangwe kgotsa gabedi ka letsatsi )

source: No ARV's
tn: Ga gona diritibatsi (Ga ke tseye diritibatsi)

source: Less then once a week
tn: Ko tlase ga bongwe mo bekeng

source: Once a week
tn: Gangwe ka beke

source: 2 to 3 times a week
tn: Gabedi go ya gararo mo bekeng

source: more than 3 times a week
tn: Go feta ga raro mo bekeng

source: Traditional, faith, or religious healer/doctor
tn: Ngaka ya setso, semoya kgotsa ya tumelo

source: Pharmacy
tn: Ko khemisiting

source: Public or government health facility or clinic
tn: Dikokelo kgotsa sepatela sa puso/goromente

source: Private health facility or clinic
tn: Kokelo kgotsa sepatela se eseng sa puso

source: Community health worker
tn: Modiri wa botsogo wa mo motseng

source: I have no problems in walking about
tn: Ga kena mathata a go tsamaya tsamaya

source: I have slight problems in walking about
tn: Ke na le bothatanyana bo se kae le go tsamayatsamaya

source: I have moderate problems in walking about
tn: Ke na le bothata jo bo lekanetseng le go tsamayatsamaya(moderate)

source: I have severe problems in walking about
tn: Ke na le bothata jo botona le go tsamayatsamaya

source: I am unable to walk about
tn: Ga ke kgone go tsamayatsamaya

source: I have no problems washing or dressing myself
tn: Ga kena mathata a go itlhapisa kgotsa go ikapesa

source: I have slight problems washing or dressing myself
tn: Ke na le bothatanyana bo se kae le go itlhapisa kgotsa go ikapesa

source: I have moderate problems washing or dressing myself
tn: Ke na le bothata jo bo lekanetseng ja go itlhapisa kgotsa go ikapesa(moderate)

source: I have severe problems washing or dressing myself
tn: Ke na le bothata jo botona le goitlhapisa kgotsa go ikapesa

source: I am unable to wash or dress myself
tn: Ga ke kgone go itlhapisa kgotsa go ikapesa

source: I have no problems doing my usual activities
tn: Ga kena mathata le go dira ditiro tsame tsa gale

source: I have slight problems doing my usual activities
tn: Ke na le bothatanyana bo se kae le go dira ditiro tsame tsa gale

source: I have moderate problems doing my usual activities
tn: Ke na le bothata jo bo lekanetseng ja go dira ditiro tsame tsa gale(moderate)

source: I have severe problems doing my usual activities
tn: Ke na le bothata jo botona le go dira ditiro tsame tsa gale

source: I am unable to do my usual activities
tn: Ga ke kgone go dira ditiro tsame tsa gale

source: I have no pain or discomfort
tn: Ga ke na ditlhabi kgotsa go sa ikutlwe sentle

source: I have slight pain or discomfort
tn: Ke na setlhabi se e seng sa sepe le go sa ikutlwe sentle mo go sa reng sepe

source: I have moderate pain or discomfort
tn: Ke na le setlhabi/ botlhoko jo bo lekanetseng (moderate pain)

source: I have severe pain or discomfort
tn: Ke na le setlhabi/botlhoko kgotsa go sa ikutlweng sentle jo bo/ mo go tona

source: I have extreme pain or discomfort
tn: Ke na le setlhabi se se tseneletseng/ ga ke ukutlwe sentle gotlhelele

source: I am not anxious or depressed
tn: Ga kena tlhobaleo kgotsa maikutlo a a kwa tlase

source: I am slightly anxious or depressed
tn: Ke a tlhobaela kgotsa ke na le maikutlo a a kwa tlase go se kae

source: I am moderately anxious or depressed
tn: Ke na le tlhobaelo kgotsa maikutlo a a kwa tlase a lekanetseng

source: I am severely anxious or depressed
tn: Ke na le tlhobaelo kgotsa maikutlo a a kwa tlase thata

source: I am extremely anxious or depressed
tn: Ke na le tlhobaleo le maikutlo a a kwa tlase mo go tseneletseng

source: Government Primary Health Clinic/Post
tn: Kokelo ya puso(Clinic/Post)

source: Chemist/Pharmacy
tn: Khemisiti

source: Hospital Outpatient Department (including government and private)
tn: Lefelo la thuso ya batho ba ba sa robadiweng( la ga goromente kgotsa la private)

source: Private Doctor
tn: Ngaka wa Private

source: Traditional or Faith Healer
tn: Ngaka ya setso kgotsa ya semoya

source: No visit in past 3 months
tn: Ga ke ise ke etele gope mo kgweding tse tharo tse di fetileng

source: HIV-related care, including TB and other opportunistic infections
tn: Tlhokomelo mabapi le seemo sa HIV, go akaretsa TB le malwetse amangwe a a amanang le HIV(bo majapolaelo)

source: Pregnancy-related care, including delivery
tn: Tlhokomelo ya boimana, go akaretsa le pelegi

source: Injuries or accidents
tn: Dikgobalo le dikotsi

source: Chronic disease related care, including high blood pressure, diabetes, cancer, mental illness
tn: Tlhokomelo, kgotsa kalafi ya malwetsi a a senang kalafi, go akaretsa madi a matona (high blood pressure), sukiri, kankere, bolwetsi jwa tlhaloganyo

source: Under 0.5 hour
tn: Ko tlase ga sephatlo sa oura

source: 0.5 to under 1 hour
tn: Sephatlo sa oura go tsena oura e le nngwe

source: 1 to under 2 hours
tn: Oura e le nngwe go tsena ko tlase ga oura tse pedi

source: 2 to under 3 hours
tn: Oura tse pedi go tsena ko tlase ga oura tse tharo

source: More than 3 hours
tn: Go feta ngwaga di oura tse tharo

source: 3 or more hours
tn: Oura tse tharo kgotsa go feta

source: I am not thinking about HIV related medical/clinical care at this time
tn: Ga ke akanyetse tlhokomelo ya botsogo ya HIV mo nakong e

source: HIV related medical/clinical care for my HIV infection is important to me but I am not ready to start it yet
tn: Tlhokomelo ya bongaka mabapi le seemo sa me sa HIV e botlhokwa mme ga ke ise ke ipaakanyetse go simolola

source: I have thought about starting HIV related medical/clinical care but have not yet tried to find a doctor or clinic
tn: Ke kile ka akanya ga ko simolola go bona thuso mabapi le seemo sa me sa mogare wa HIV mme ga ke ise ke dire maiteko a go batla ngaka kgotsa kokelo

source: I have found a doctor or clinic for HIV related medical/clinical care but have not yet tried to make an appointment
tn: Ke bone ngaka kgotsa kokelo e e fang thuso mabapi le HIV mme ga ke ise ke dire thulaganyo ya go ya teng

source: I have tried to obtain HIV related medical/clinical care from a doctor or clinic but have not been successful yet
tn: Ke lekile go batla thuso mabapi le seemo sa me sa HIV mo ngakeng kgotsa mo kokeleong, mme ga ke ise ke atlege

source: I have an appointment for HIV related medical/clinical care for my HIV infection but have not been for it yet
tn: Ke dirile thulaganyo ya go bona thuso ya seemo sa me sa HIV mme ga ke ise ke tsamaye

source: I don't know where to go for HIV related medical/clinical care
tn: Ga ke itse gore ke ka ya kae go amogela tlhokomelo ya botsogo ya HIV?

source: I do not have the money for HIV related medical/clinical care
tn: Ga ke na madi a ke ka a dirisetsang botsogo jwaa seemo sa HIV

source: Government dispensary
tn: Lefelo la melemo la ga Goromente (dispensary)

source: Government health center
tn: Kokelo ya puso

source: Government hospital
tn: Sepatela sa Goromente

source: Christian/mission health center
tn: Sepatela sa Kereke/Mission

source: Islamic health center
tn: Sepatela sa Islam

source: Private health center for all illnesses
tn: Kokelo kgotsa sepatela se eseng sa puso

source: Private health center for HIV/AIDS
tn: Kokelo kgotsa sepatela se eseng sa puso

source: Mobile services
tn: Ditlamelo tsa kolotsana (mobile)

source: NGO clinic
tn: Kokelo ya lekgotla le le ikemetseng ka nosi (NGO)

source: 0 times
tn: lehela

source: 1 time
tn: Ga ngwe

source: 2 times
tn: Ga bedi

source: 3 times
tn: Ga raro

source: 4 times
tn: Gane

source: 5 times
tn: ga tlhano

source: 6-10 times
tn: thatharo go ya go lesome

source: More than 10 times
tn: Go feta lesome

source: All of the time (always)
tn: Nako tsotlhe

source: Most of the time (almost always)
tn: Nako tse dintsi

source: Some of the time (sometimes)
tn: Nako nngwe(Fa gongwe)

source: Almost none of the time (rarely)
tn: Ka sewelo

source: None of the time (never)
tn: Ga ise/ Ga gona

source: Yes, In the government sector
tn: Ee, mo makalaneng a puso (ke theogela malatsi)

source: Yes, in the private sector
tn: Ee mo makalaneng a ikemetseng ka nosi (ke thelogela malatsi otlhe)

source: Yes, self-employed working on my own
tn: Ee ke a ipereka, ke bereka ke le nosi

source: Yes, self-employed with own employees
tn: Ee ke a ipereka ke na le babereki

source: No, not working
tn: Nnya, Ga ke bereke

source: Farmer (own land)
tn: Molemi (ke na le lefatshe lame)

source: Farm worker (work on employers land)
tn: Ke bereka mo tshimong/polase (ke bereka mo lefatsheng la mohiri)

source: Domestic Worker
tn: Ke bereka mo lwapeng
